<h1 style="font-family:'Glacial Indifference', sans-serif; font-size:32px; text-align:center; background-color:teal; color:white; border-radius: 15px 50px; ">TOP SQL 50 </h1>

> This notebook gathers my own solution for 50 SQL interviews questions on Leetcode. A full list of these questions are accessible [here](https://leetcode.com/studyplan/top-sql-50/).
> 
> The dialect I used for these challenges is MySQL. For each problem, its hyperlink and corresponding LeetCode number and name are provided at the beginning."

<details>
    <summary><b>Leetcode badge for challenge completion</b></summary>
    <p>
        <div style="text-align: center;">
            <img src="Top_SQL_50.gif" width="150">
        </div>
    </p>
</details>

# SECTION 1: SELECT

## Problem 1

*[(1757. Recyclable and Low Fat Products)](https://leetcode.com/problems/recyclable-and-low-fat-products/description/)*

### Problem statement

Table `Products`

| Column Name | Type    |
|-------------|---------|
| product_id  | int     |
| low_fats    | enum    |
| recyclable  | enum    |

`product_id` is the primary key (column with unique values) for this table.  
`low_fats` is an ENUM (category) of type ('Y', 'N') where 'Y' means this product is low fat and 'N' means it is not.   
`recyclable` is an ENUM (category) of types ('Y', 'N') where 'Y' means this product is recyclable and 'N' means it is not.

Write a solution to **find the ids of products that are both low fat and recyclable.**

Return the result table in **any order.**

The result format is in the following example.

**Example 1**

**Input:**

`Products` table:
| product_id  | low_fats | recyclable |
|-------------|----------|------------|
| 0           | Y        | N          |
| 1           | Y        | Y          |
| 2           | N        | Y          |
| 3           | Y        | Y          |
| 4           | N        | N          |

**Output:**  
| product_id  |
|-------------|
| 1           |
| 3           |

**Explanation:** Only products 1 and 3 are both low fat and recyclable.

### Solution

In [ ]:
SELECT product_id
FROM Products
WHERE low_fats = 'y' AND recyclable = 'y';

## Problem 2

*[(584. Find Customer Referee)](https://leetcode.com/problems/find-customer-referee/description/)*

### Problem statement

Table: `Customer`

| Column Name | Type    |
|-------------|---------|
| id          | int     |
| name        | varchar |
| referee_id  | int     |

`id` is the primary key column for this table.  
Each row of this table indicates the id of a customer, their name, and the id of the customer who referred them.

Find the **names of the customers that are not referred by the customer with** `id = 2`.

Return the result table in **any order.**

The result format is as follows:

**Example 2**

**Input:**

`Customer` table:

| id | name | referee_id |
|----|------|------------|
| 1  | Will | null       |
| 2  | Jane | null       |
| 3  | Alex | 2          |
| 4  | Bill | null       |
| 5  | Zack | 1          |
| 6  | Mark | 2          |

**Output:**

| name |
|------|
| Will |
| Jane |
| Bill |
| Zack |

### Solution

In [ ]:
SELECT name
FROM Customer
WHERE referee_id <> 2 OR referee_id IS NULL;

## Problem 3

*[(595. Big Countries)](https://leetcode.com/problems/big-countries/description)*

### Problem statement

Table: `World`

| Column Name | Type    |
|-------------|---------|
| name        | varchar |
| continent   | varchar |
| area        | int     |
| population  | int     |
| gdp         | bigint  |

`name` is the primary key (column with unique values) for this table.  
Each row of this table gives information about the name of a country, the continent to which it belongs, its area, the population, and its GDP value.

A country is considered big if:
- it has an area of at least three million (i.e., 3000000 kmÂ²), or
- it has a population of at least twenty-five million (i.e., 25000000).

Write a solution to **find the name, population, and area of the big countries.**

Return the result table in **any** order.

**Example:**

**Input:**

`World` table:
| name        | continent | area    | population | gdp          |
|-------------|-----------|---------|------------|--------------|
| Afghanistan | Asia      | 652230  | 25500100   | 20343000000  |
| Albania     | Europe    | 28748   | 2831741    | 12960000000  |
| Algeria     | Africa    | 2381741 | 37100000   | 188681000000 |
| Andorra     | Europe    | 468     | 78115      | 3712000000   |
| Angola      | Africa    | 1246700 | 20609294   | 100990000000 |

**Output:**
| name        | population | area    |
|-------------|------------|---------|
| Afghanistan | 25500100   | 652230  |
| Algeria     | 37100000   | 2381741 |

### Solution

In [ ]:
SELECT name, population, area
FROM World
WHERE area >= 3000000 OR population >= 25000000;

## Problem 4

*[(1148. Article Views I)](https://leetcode.com/problems/article-views-i/description)*

### Problem statement

Table: `Views`

| Column Name | Type    |
|-------------|---------|
| article_id  | int     |
| author_id   | int     |
| viewer_id   | int     |
| view_date   | date    |

Each row of this table indicates that some viewer viewed an article (written by some author) on some date. Note that equal `author_id` and `viewer_id` indicate the same person.

Write a solution to find all the authors that viewed at least one of their own articles.

Return the result table sorted by `id` in ascending order.

**Example:**

**Input:**  

`Views` table:
| article_id | author_id | viewer_id | view_date  |
|------------|-----------|-----------|------------|
| 1          | 3         | 5         | 2019-08-01 |
| 1          | 3         | 6         | 2019-08-02 |
| 2          | 7         | 7         | 2019-08-01 |
| 2          | 7         | 6         | 2019-08-02 |
| 4          | 7         | 1         | 2019-07-22 |
| 3          | 4         | 4         | 2019-07-21 |
| 3          | 4         | 4         | 2019-07-21 |

**Output:**  
| id   |
|------|
| 4    |
| 7    |

### Solution

In [ ]:
SELECT author_id AS id
FROM Views
WHERE Views.author_id = Views.viewer_id
GROUP BY id
ORDER BY id

## Problem 5

### Problem statement

*[(1683. Invalid Tweets)](https://leetcode.com/problems/invalid-tweets/description)*

Table: `Tweets`

| Column Name | Type    |
|-------------|---------|
| tweet_id    | int     |
| content     | varchar |

`tweet_id` is the primary key (column with unique values) for this table. This table contains all the tweets in a social media app.
The tweet is invalid if the number of characters used in the content of the tweet is strictly greater than 15.

Write a solution to **find the IDs of the invalid tweets.** 

Return the result table in any order.

**Example 1:**

**Input:**  

`Tweets` table:
| tweet_id | content                          |
|----------|----------------------------------|
| 1        | Vote for Biden                   |
| 2        | Let us make America great again! |

**Output:**  
| tweet_id |
|----------|
| 2        |

**Explanation:**  
Tweet 1 has length = 14. It is a valid tweet.  
Tweet 2 has length = 32. It is an invalid tweet.

### Solution

In [ ]:
SELECT tweet_id
FROM Tweets
WHERE length(content) > 15

---

# SECTION 2: BASIC JOINS

## Problem 6

### Problem statement

*[(1378. Replace Employee ID With The Unique Identifier)](https://leetcode.com/problems/https://leetcode.com/problems/replace-employee-id-with-the-unique-identifier/description)*

Table: `Employees`

| Column Name | Type    |
|-------------|---------|
| id          | int     |
| name        | varchar |

`id` is the primary key (column with unique values) for this table.  
Each row of this table contains the id and the name of an employee in a company.

Table: `EmployeeUNI`

| Column Name | Type    |
|-------------|---------|
| id          | int     |
| unique_id   | int     |

`(id, unique_id)` is the primary key (combination of columns with unique values) for this table.  
Each row of this table contains the id and the corresponding unique id of an employee in the company.

Write a solution to **show the** unique ID **of each user**. If a user does not have a unique ID, replace it with `null`.

Return the result table in **any order.**

**Example 1:**

**Input:**  

`Employees` table:
| id | name     |
|----|----------|
| 1  | Alice    |
| 7  | Bob      |
| 11 | Meir     |
| 90 | Winston  |
| 3  | Jonathan |

`EmployeeUNI` table:
| id | unique_id |
|----|-----------|
| 3  | 1         |
| 11 | 2         |
| 90 | 3         |

**Output:**  
| unique_id | name     |
|-----------|----------|
| null      | Alice    |
| null      | Bob      |
| 2         | Meir     |
| 3         | Winston  |
| 1         | Jonathan |

**Explanation:**  
- Alice and Bob do not have a unique ID, so we show null instead.  
- The unique ID of Meir is 2.  
- The unique ID of Winston is 3.  
- The unique ID of Jonathan is 1.

### Solution

In [ ]:
SELECT e_id.unique_id, e_name.name
FROM EmployeeUNI AS e_id
RIGHT JOIN Employees AS e_name
ON e_id.id = e_name.id

## Problem 7

*[(1068. Product Sales Analysis I)](https://leetcode.com/problems/product-sales-analysis-i/description)*

### Problem statement

Table: `Sales`

| Column Name | Type  |
|-------------|-------|
| sale_id     | int   |
| product_id  | int   |
| year        | int   |
| quantity    | int   |
| price       | int   |

`(sale_id, year)` is the primary key (combination of columns with unique values) of this table.  
`product_id` is a foreign key (reference column) to `Product` table.  
Each row of this table shows a sale on the product `product_id` in a certain year. Note that the price is per unit.

Table: `Product`

| Column Name  | Type    |
|--------------|---------|
| product_id   | int     |
| product_name | varchar |

`product_id` is the primary key (column with unique values) of this table.  
Each row of this table indicates the product name of each product.

Write a solution to **report the** `product_name`, `year`**, and** `price` **for each** `sale_id` **in the** `Sales` **table.**

Return the resulting table in **any order**.

**Example 1:**

**Input:**  

`Sales` table:
| sale_id | product_id | year | quantity | price |
|---------|------------|------|----------|-------| 
| 1       | 100        | 2008 | 10       | 5000  |
| 2       | 100        | 2009 | 12       | 5000  |
| 7       | 200        | 2011 | 15       | 9000  |

`Product` table:
| product_id | product_name |
|------------|--------------|
| 100        | Nokia        |
| 200        | Apple        |
| 300        | Samsung      |

**Output:**  
| product_name | year  | price |
|--------------|-------|-------|
| Nokia        | 2008  | 5000  |
| Nokia        | 2009  | 5000  |
| Apple        | 2011  | 9000  |

**Explanation:**  
- From sale_id = 1, we can conclude that Nokia was sold for 5000 in the year 2008.
- From sale_id = 2, we can conclude that Nokia was sold for 5000 in the year 2009.
- From sale_id = 7, we can conclude that Apple was sold for 9000 in the year 2011.

### Solution

In [ ]:
SELECT Product.product_name, Sales.year, Sales.price
FROM Sales
LEFT JOIN Product
ON Sales.product_id = Product.product_id

## Problem 8

*[(1581. Customer Who Visited but Did Not Make Any Transactions)](https://leetcode.com/problems/customer-who-visited-but-did-not-make-any-transactions/)*

### Problem statement

Table: `Visits`

| Column Name | Type    |
|-------------|---------|
| visit_id    | int     |
| customer_id | int     |

`visit_id` is the column with unique values for this table. This table contains information about the customers who visited the mall.

Table: `Transactions`

| Column Name    | Type    |
|----------------|---------|
| transaction_id | int     |
| visit_id       | int     |
| amount         | int     |

`transaction_id` is column with unique values for this table. This table contains information about the transactions made during the `visit_id`.

Write a solution to **find the IDs of the users who visited without making any transactions and the number of times they made these types of visits.**

Return the result table sorted in **any order**.

**Example 1:**

**Input:**  

`Visits` table
| visit_id | customer_id |
|----------|-------------|
| 1        | 23          |
| 2        | 9           |
| 4        | 30          |
| 5        | 54          |
| 6        | 96          |
| 7        | 54          |
| 8        | 54          |

`Transactions` table
| transaction_id | visit_id | amount |
|----------------|----------|--------|
| 2              | 5        | 310    |
| 3              | 5        | 300    |
| 9              | 5        | 200    |
| 12             | 1        | 910    |
| 13             | 2        | 970    |

**Output:**  
| customer_id | count_no_trans |
|-------------|----------------|
| 54          | 2              |
| 30          | 1              |
| 96          | 1              |

**Explanation:**  
- Customer with id = 23 visited the mall once and made one transaction during the visit with id = 12.  
- Customer with id = 9 visited the mall once and made one transaction during the visit with id = 13.  
- Customer with id = 30 visited the mall once and did not make any transactions.  
- Customer with id = 54 visited the mall three times. During 2 visits they did not make any transactions, and during one visit they made 3 transactions.  
- Customer with id = 96 visited the mall once and did not make any transactions.
  
As we can see, users with IDs 30 and 96 visited the mall one time without making any transactions. Also, user 54 visited the mall twice and did not make any transactions.

### Solution

In [ ]:
SELECT Visits.customer_id, COUNT(*) as count_no_trans
FROM Visits
LEFT JOIN Transactions
ON Visits.visit_id = Transactions.visit_id
WHERE transaction_id IS NULL
GROUP BY Visits.customer_id

## Problem 9

### Problem statement

*[(197. Rising Temperature)](https://leetcode.com/problems/rising-temperature/)*

Table: `Weather`

| Column Name | Type  |
|-------------|-------|
| id          | int   |
| recordDate  | date  |
| temperature | int   |

`id` is the column with unique values for this table. There are no different rows with the same `recordDate`. This table contains information about the temperature on a certain day.

Write a solution to *find all dates' `Id` with higher temperatures compared to its previous dates (yesterday).*

Return the result table in **any order**.

**Example 1:**

**Input:**  

`Weather` table:
| id | recordDate | temperature |
|----|------------|-------------|
| 1  | 2015-01-01 | 10          |
| 2  | 2015-01-02 | 25          |
| 3  | 2015-01-03 | 20          |
| 4  | 2015-01-04 | 30          |

**Output:**  
| id |
|----|
| 2  |
| 4  |

**Explanation:**  
- In 2015-01-02, the temperature was higher than the previous day (10 -> 25).  
- In 2015-01-04, the temperature was higher than the previous day (20 -> 30).

### Solution

In [ ]:
SELECT id
FROM (
    SELECT 
        id,
        temperature,
        recordDate,
        LAG(temperature) OVER (ORDER BY recordDate) AS prev_temperature,
        LAG(recordDate) OVER (ORDER BY recordDate) AS prev_recordDate
    FROM Weather
) AS weather_with_lag
WHERE temperature > prev_temperature
  AND DATEDIFF(recordDate, prev_recordDate) = 1;

**Idea**: Using a subquery to compute the lagged temperature and date using the LAG() window function ordered by recordDate, and then filters the results based on the specified conditions.

## Problem 10

*[(1661. Average Time of Process per Machine)](https://leetcode.com/problems/average-time-of-process-per-machine/)*

### Problem statement

Table: `Activity`

| Column Name   | Type   |
|---------------|--------|
| machine_id    | int    |
| process_id    | int    |
| activity_type | enum   |
| timestamp     | float  |

The table shows the user activities for a factory website. `(machine_id, process_id, activity_type)` is the primary key (combination of columns with unique values) of this table.   
`machine_id` is the ID of a machine.  
`process_id` is the ID of a process running on the machine with ID `machine_id`.  
`activity_type` is an ENUM (category) of type ('start', 'end'). 'start' means the machine starts the process at the given timestamp and 'end' means the machine ends the process at the given timestamp. The 'start' timestamp will always be before the 'end' timestamp for every (`machine_id`, `process_id`) pair.  
`timestamp` is a float representing the current time in seconds.

There is a factory website that has several machines each running the **same number of processes**. Write a solution to **find the average time each machine takes to complete a process.**

The time to complete a process is the 'end' timestamp minus the 'start' timestamp. The average time is calculated by the total time to complete every process on the machine divided by the number of processes that were run.

The resulting table should have the `machine_id` along with the average time as `processing_time`, which should be **rounded to 3 decimal places.**

Return the result table in **any order.**

The result format is in the following example.

**Example 1:**

**Input:**  
`Activity` table:
| machine_id | process_id | activity_type | timestamp |
|------------|------------|---------------|-----------|
| 0          | 0          | start         | 0.712     |
| 0          | 0          | end           | 1.520     |
| 0          | 1          | start         | 3.140     |
| 0          | 1          | end           | 4.120     |
| 1          | 0          | start         | 0.550     |
| 1          | 0          | end           | 1.550     |
| 1          | 1          | start         | 0.430     |
| 1          | 1          | end           | 1.420     |
| 2          | 0          | start         | 4.100     |
| 2          | 0          | end           | 4.512     |
| 2          | 1          | start         | 2.500     |
| 2          | 1          | end           | 5.000     |

**Output:**  
| machine_id | processing_time |
|------------|-----------------|
| 0          | 0.894           |
| 1          | 0.995           |
| 2          | 1.456           |

**Explanation:**  
There are 3 machines running 2 processes each. 
- Machine 0's average time is ((1.520 - 0.712) + (4.120 - 3.140)) / 2 = 0.894
- Machine 1's average time is ((1.550 - 0.550) + (1.420 - 0.430)) / 2 = 0.995
- Machine 2's average time is ((4.512 - 4.100) + (5.000 - 2.500)) / 2 = 1.456

### Solution

In [ ]:
WITH startset AS(
    SELECT machine_id, process_id, activity_type, timestamp
    FROM Activity
    WHERE activity_type = "start"
),
endset AS(
    SELECT machine_id, process_id, activity_type, timestamp
    FROM Activity
    WHERE activity_type = "end"
)

SELECT startset.machine_id, ROUND(AVG(endset.timestamp - startset.timestamp),3) as processing_time
FROM startset
LEFT JOIN endset
ON startset.machine_id = endset.machine_id
AND startset.process_id = endset.process_id
GROUP BY machine_id;

**Idea**: Using CTE, we create seperate start and end time table. Then, we joins these tables based on the machine and process IDs. After joining, we calculates the processing time for each process. Finally, we calculate averages of these processing times for each machine.

## Problem 11

[577. Employee Bonus](https://leetcode.com/problems/employee-bonus/)

### Problem statement

Table: `Employee`

| Column Name | Type    |
|-------------|---------|
| empId       | int     |
| name        | varchar |
| supervisor  | int     |
| salary      | int     |

`empId` is the column with unique values for this table.  
Each row of this table indicates the name and the ID of an employee in addition to their salary and the id of their manager.

Table: `Bonus`

| Column Name | Type |
|-------------|------|
| empId       | int  |
| bonus       | int  |

`empId` is the column of unique values for this table.  
`empId` is a foreign key (reference column) to empId from the Employee table.  
Each row of this table contains the id of an employee and their respective bonus.

Write a solution to **report the name and bonus amount of each employee with a bonus less than 1000.**  
Return the result table in **any order.**

**Example:**

**Input:**  

`Employee` table:
| empId | name   | supervisor | salary |
|-------|--------|------------|--------|
| 3     | Brad   | null       | 4000   |
| 1     | John   | 3          | 1000   |
| 2     | Dan    | 3          | 2000   |
| 4     | Thomas | 3          | 4000   |

`Bonus` table:
| empId | bonus |
|-------|-------|
| 2     | 500   |
| 4     | 2000  |

**Output:** 
| name  | bonus |
|-------|-------|
| Brad  | null  |
| John  | null  |
| Dan   | 500   |

### Solution

In [ ]:
SELECT name, bonus
FROM (
  SELECT e.name, b.bonus
  FROM Employee e
  LEFT JOIN bonus b ON e.empId = b.empId
) AS subquery
WHERE bonus < 1000 or bonus is null;

**Idea**: Using subquery, we first create a join from two tables, then filter using WHERE, with the null included.

## Problem 12

*[(1280. Students and Examinations)](https://leetcode.com/problems/students-and-examinations/)*

### Problem statement

Table: `Students`

| Column Name   | Type    |
|---------------|---------|
| student_id    | int     |
| student_name  | varchar |

`student_id` is the primary key (column with unique values) for this table.  
Each row of this table contains the ID and the name of one student in the school.

Table: `Subjects`
| Column Name   | Type    |
|---------------|---------|
| subject_name  | varchar |

`subject_name` is the primary key (column with unique values) for this table.  
Each row of this table contains the name of one subject in the school.

Table: `Examinations`

| Column Name   | Type    |
|---------------|---------|
| student_id    | int     |
| subject_name  | varchar |

There is no primary key (column with unique values) for this table. It may contain duplicates.  
Each student from the Students table takes every course from the Subjects table.  
Each row of this table indicates that a student with ID student_id attended the exam of subject_name.  

Write a solution to **find the number of times each student attended each exam.**

Return the result table **ordered by** `student_id` **and** `subject_name`.

The result format is in the following example.

**Example 1:**

**Input:**  

`Students` table:
| student_id | student_name |
|------------|--------------|
| 1          | Alice        |
| 2          | Bob          |
| 13         | John         |
| 6          | Alex         |

`Subjects` table:
| subject_name |
|--------------|
| Math         |
| Physics      |
| Programming  |

`Examinations` table:
| student_id | subject_name |
|------------|--------------|
| 1          | Math         |
| 1          | Physics      |
| 1          | Programming  |
| 2          | Programming  |
| 1          | Physics      |
| 1          | Math         |
| 13         | Math         |
| 13         | Programming  |
| 13         | Physics      |
| 2          | Math         |
| 1          | Math         |

**Output:** 
| student_id | student_name | subject_name | attended_exams |
|------------|--------------|--------------|----------------|
| 1          | Alice        | Math         | 3              |
| 1          | Alice        | Physics      | 2              |
| 1          | Alice        | Programming  | 1              |
| 2          | Bob          | Math         | 1              |
| 2          | Bob          | Physics      | 0              |
| 2          | Bob          | Programming  | 1              |
| 6          | Alex         | Math         | 0              |
| 6          | Alex         | Physics      | 0              |
| 6          | Alex         | Programming  | 0              |
| 13         | John         | Math         | 1              |
| 13         | John         | Physics      | 1              |
| 13         | John         | Programming  | 1              |

**Explanation:** 
The result table should contain all students and all subjects.  
- Alice attended the Math exam 3 times, the Physics exam 2 times, and the Programming exam 1 time.
- Bob attended the Math exam 1 time, the Programming exam 1 time, and did not attend the Physics exam.
- Alex did not attend any exams.
- John attended the Math exam 1 time, the Physics exam 1 time, and the Programming exam 1 time.

### Solution

In [ ]:
WITH attended_count AS (
    SELECT student_id, subject_name, COUNT(*) AS attended_exams
    FROM Examinations
    GROUP BY student_id, subject_name
)

SELECT Students.student_id, Students.student_name, Subjects.subject_name, IFNULL(attended_count.attended_exams, 0) AS attended_exams
FROM Students
CROSS JOIN Subjects
LEFT JOIN attended_count
    ON Students.student_id = attended_count.student_id
    AND Subjects.subject_name = attended_count.subject_name
ORDER BY student_id, subject_name;

**Idea**: 
- Using CTE, we count attended exams for each student, on each subject.
- Perform CROSS JOIN on `Students` table to ensure that all combinations of students and subjects are included in the result, using IFNULL to fill NA by 0.
- Afterward, LEFT JOIN with our CTE, again by student-subject pair.
- Order the result as specified.

## Problem 13

*[(570. Managers with at Least 5 Direct Reports)](https://leetcode.com/problems/managers-with-at-least-5-direct-reports/)*

### Problem statement

Table: `Employee`

| Column Name | Type    |
|-------------|---------|
| id          | int     |
| name        | varchar |
| department  | varchar |
| managerId   | int     |

`id` is the primary key (column with unique values) for this table.  
Each row of this table indicates the name of an employee, their department, and the id of their manager.  
If `managerId` is null, then the employee does not have a manager.  
No employee will be the manager of themself.

Write a solution to find **managers with at least five direct reports.**

Return the result table in **any order.**

The result format is in the following example.

**Example 1:**

**Input:** 

`Employee` table:
| id  | name  | department | managerId |
|-----|-------|------------|-----------|
| 101 | John  | A          | null      |
| 102 | Dan   | A          | 101       |
| 103 | James | A          | 101       |
| 104 | Amy   | A          | 101       |
| 105 | Anne  | A          | 101       |
| 106 | Ron   | B          | 101       |

**Output:**
| name |
|------|
| John |

### Solution

In [ ]:
SELECT e.name
FROM Employee e
JOIN (
    SELECT managerId, COUNT(managerId) AS num_reports
    FROM Employee
    GROUP BY managerId
    HAVING COUNT(managerId) >= 5
) reports_count ON e.id = reports_count.managerId;

**Idea**: We use subquery to find manager with at least 5 direct reports, using HAVING condition (as WHERE doesn't work after GROUP BY). Then, use JOIN to take out only those managers' names.

## Problem 14

*[(1934. Confirmation Rate)](https://leetcode.com/problems/confirmation-rate/)*

### Problem statement

Table: `Signups`

| Column Name | Type     |
|-------------|----------|
| user_id     | int      |
| time_stamp  | datetime |

`user_id` is the column of unique values for this table.  
Each row contains information about the signup time for the user with ID user_id.

Table: `Confirmations`

| Column Name | Type     |
|-------------|----------|
| user_id     | int      |
| time_stamp  | datetime |
| action      | ENUM     |

`(user_id, time_stamp)` is the primary key (combination of columns with unique values) for this table.  
`user_id` is a foreign key (reference column) to the `Signups` table.  
`action` is an ENUM (category) of the type ('confirmed', 'timeout').  
Each row of this table indicates that the user with ID `user_id` requested a confirmation message at time_stamp and that confirmation message was either confirmed ('confirmed') or expired without confirming ('timeout').

The confirmation rate of a user is the number of 'confirmed' messages divided by the total number of requested confirmation messages. The confirmation rate of a user that did not request any confirmation messages is 0. Round the confirmation rate to **two decimal places.**

Write a solution to **find the confirmation rate of each user.**

Return the result table in **any order.**

The result format is in the following example.

**Example 1:**

**Input:**  

`Signups` table:
| user_id | time_stamp          |
|---------|---------------------|
| 3       | 2020-03-21 10:16:13 |
| 7       | 2020-01-04 13:57:59 |
| 2       | 2020-07-29 23:09:44 |
| 6       | 2020-12-09 10:39:37 |

`Confirmations` table:
| user_id | time_stamp          | action    |
|---------|---------------------|-----------|
| 3       | 2021-01-06 03:30:46 | timeout   |
| 3       | 2021-07-14 14:00:00 | timeout   |
| 7       | 2021-06-12 11:57:29 | confirmed |
| 7       | 2021-06-13 12:58:28 | confirmed |
| 7       | 2021-06-14 13:59:27 | confirmed |
| 2       | 2021-01-22 00:00:00 | confirmed |
| 2       | 2021-02-28 23:59:59 | timeout   |

**Output:**  
| user_id | confirmation_rate |
|---------|-------------------|
| 6       | 0.00              |
| 3       | 0.00              |
| 7       | 1.00              |
| 2       | 0.50              |

**Explanation:**  
- User 6 did not request any confirmation messages. The confirmation rate is 0.
- User 3 made 2 requests and both timed out. The confirmation rate is 0.
- User 7 made 3 requests and all were confirmed. The confirmation rate is 1.
- User 2 made 2 requests where one was confirmed and the other timed out. The confirmation rate is 1 / 2 = 0.5.

### Solution

In [ ]:
SELECT 
    Signups.user_id,
    IFNULL(ROUND(SUM(Confirmations.action = 'confirmed') / COUNT(Confirmations.action), 2), 0) AS confirmation_rate 
FROM Signups
LEFT JOIN Confirmations ON Signups.user_id = Confirmations.user_id
GROUP BY Signups.user_id;

---

# SECTION 3: BASIC AGGREGATE FUNCTIONS

## Problem 15

*[(620. Not Boring Movies)](https://leetcode.com/problems/not-boring-movies)*

### Problem statement

Table: `Cinema`

| Column Name | Type     |
|-------------|----------|
| id          | int      |
| movie       | varchar  |
| description | varchar  |
| rating      | float    |

`id` is the primary key (column with unique values) for this table.  
Each row contains information about the name of a movie, its genre, and its rating. rating is a 2 decimal places float in the range [0, 10].

Write a solution to **report the movies with an odd-numbered ID and a description that is not "boring".**

Return the result table **ordered by rating in descending order.**

The result format is in the following example.

**Example 1:**

**Input:** 

`Cinema` table:
| id | movie     | description | rating |
|----|-----------|-------------|--------|
| 1  | War       | great 3D    | 8.9    |
| 2  | Science   | fiction     | 8.5    |
| 3  | irish     | boring      | 6.2    |
| 4  | Ice song  | Fantacy     | 8.6    |
| 5  | House card| Interesting | 9.1    |

**Output:**
| id | movie      | description | rating |
|----|------------|-------------|--------|
| 5  | House card | Interesting | 9.1    |
| 1  | War        | great 3D    | 8.9    |

**Explanation:**
We have three movies with odd-numbered IDs: 1, 3, and 5. The movie with ID = 3 is boring so we do not include it in the answer.

### Solution

In [ ]:
SELECT *
FROM Cinema
WHERE id % 2 = 1 AND description != 'boring'
ORDER BY rating DESC;

## Problem 16

*[(1251. Average Selling Price)](https://leetcode.com/problems/average-selling-price)*

### Problem statement

Table: `Prices`

| Column Name | Type    |
|-------------|---------|
| product_id  | int     |
| start_date  | date    |
| end_date    | date    |
| price       | int     |

`(product_id, start_date, end_date)` is the primary key (combination of columns with unique values) for this table.  
Each row of this table indicates the price of the `product_id` in the period from `start_date` to `end_date`.  
For each `product_id`, there will be no two overlapping periods. That means there will be no two intersecting periods for the same `product_id`.

Table: `UnitsSold`

| Column Name   | Type    |
|---------------|---------|
| product_id    | int     |
| purchase_date | date    |
| units         | int     |

This table may contain duplicate rows.  
Each row of this table indicates the `date`, `units`, and `product_id` of each product sold.

Write a solution to find the **average selling price for each product**. `average_price` should be rounded to 2 decimal places.

Return the result table in **any order.**

The result format is in the following example.

**Example 1:**

**Input:**
`Prices` table:
| product_id | start_date | end_date   | price  |
|------------|------------|------------|--------|
| 1          | 2019-02-17 | 2019-02-28 | 5      |
| 1          | 2019-03-01 | 2019-03-22 | 20     |
| 2          | 2019-02-01 | 2019-02-20 | 15     |
| 2          | 2019-02-21 | 2019-03-31 | 30     |

`UnitsSold` table:
| product_id | purchase_date | units |
|------------|---------------|-------|
| 1          | 2019-02-25    | 100   |
| 1          | 2019-03-01    | 15    |
| 2          | 2019-02-10    | 200   |
| 2          | 2019-03-22    | 30    |

**Output:** 
| product_id | average_price |
|------------|---------------|
| 1          | 6.96          |
| 2          | 16.96         |

**Explanation:** 
- Average selling price = Total Price of Product / Number of products sold.  
- Average selling price for product 1 = ((100 * 5) + (15 * 20)) / 115 = 6.96  
- Average selling price for product 2 = ((200 * 15) + (30 * 30)) / 230 = 16.96

### Solution

In [ ]:
WITH tempo AS(
SELECT us.product_id, us.purchase_date, us.units, 
CASE
  WHEN us.purchase_date BETWEEN p.start_date AND p.end_date THEN p.price
  ELSE NULL
END AS match_price
FROM UnitsSold us
JOIN Prices p ON us.product_id = p.product_id
)
SELECT  product_id,
        ROUND(SUM(match_price*units)/SUM(units), 2) AS average_price
FROM tempo
WHERE match_price IS NOT NULL
GROUP BY product_id

**Idea**: Create a CTE name tempo, which calculating match_price column using corresponding price of each product for corresponding period. The output of the CTE if we use the example above should look like this:

| product_id | purchase_date | units | match_price |
|------------|---------------|-------|-------------|
| 1          | 2019-02-25    | 100   | 5           |
| 1          | 2019-03-01    | 15    | 20          |
| 2          | 2019-02-10    | 200   | 15          |
| 2          | 2019-03-22    | 30    | 30          |

Then, calculate the average price group by `product_id`, exclude the `NULL` case if exist, and rounded as specified.

## Problem 17

*[(1075. Project Employees I)](https://leetcode.com/problems/project-employees-i)*

### Problem statement

Table: `Project`

| Column Name | Type |
|-------------|------|
| project_id  | int  |
| employee_id | int  |

`(project_id, employee_id)` is the primary key of this table.  
`employee_id` is a foreign key to `Employee` table.  
Each row of this table indicates that the employee with `employee_id` is working on the project with `project_id`.

Table: `Employee`

| Column Name      | Type    |
|------------------|---------|
| employee_id      | int     |
| name             | varchar |
| experience_years | int     |

`employee_id` is the primary key of this table. It's guaranteed that `experience_years` is not NULL.  
Each row of this table contains information about one employee.

Write an SQL query that reports the **average experience years of all the employees for each project**, rounded to 2 digits.

Return the result table in **any order**.

The query result format is in the following example.

**Example 1:**

**Input:** 

`Project` table:
| project_id | employee_id |
|------------|-------------|
| 1          | 1           |
| 1          | 2           |
| 1          | 3           |
| 2          | 1           |
| 2          | 4           |

`Employee` table:
| employee_id | name   | experience_years |
|-------------|--------|------------------|
| 1           | Khaled | 3                |
| 2           | Ali    | 2                |
| 3           | John   | 1                |
| 4           | Doe    | 2                |

**Output:** 
| project_id | average_years |
|------------|---------------|
| 1          | 2.00          |
| 2          | 2.50          |

**Explanation:** 
The average experience years for the first project is (3 + 2 + 1) / 3 = 2.00 and for the second project is (3 + 2) / 2 = 2.50

### Solution

In [ ]:
SELECT project_id, ROUND(AVG(e.experience_years), 2) AS average_years 
FROM Employee e
RIGHT JOIN Project p ON e.employee_id = p.employee_id   
GROUP BY project_id

## Problem 18

*[(1633. Percentage of Users Attended a Contest)](https://leetcode.com/problems/percentage-of-users-attended-a-contest)*

### Problem statement

Table: `Users`

| Column Name | Type    |
|-------------|---------|
| user_id     | int     |
| user_name   | varchar |

`user_id` is the primary key (column with unique values) for this table.  
Each row of this table contains the name and the id of a user.

Table: `Register`

| Column Name | Type    |
|-------------|---------|
| contest_id  | int     |
| user_id     | int     |

`(contest_id, user_id)` is the primary key (combination of columns with unique values) for this table.  
Each row of this table contains the id of a user and the contest they registered into.

Write a solution to find the **percentage of the users registered in each contest** rounded to two decimals.

Return the result table **ordered by percentage in descending order**. In case of a tie, order it by `contest_id` in **ascending order.**

The result format is in the following example.

**Example 1:**

**Input:** 

`Users` table:
| user_id | user_name |
|---------|-----------|
| 6       | Alice     |
| 2       | Bob       |
| 7       | Alex      |

`Register` table:
| contest_id | user_id |
|------------|---------|
| 215        | 6       |
| 209        | 2       |
| 208        | 2       |
| 210        | 6       |
| 208        | 6       |
| 209        | 7       |
| 209        | 6       |
| 215        | 7       |
| 208        | 7       |
| 210        | 2       |
| 207        | 2       |
| 210        | 7       |

**Output:** 
| contest_id | percentage |
|------------|------------|
| 208        | 100.0      |
| 209        | 100.0      |
| 210        | 100.0      |
| 215        | 66.67      |
| 207        | 33.33      |

**Explanation:** 
- All the users registered in contests 208, 209, and 210. The percentage is 100% and we sort them in the answer table by `contest_id` in ascending order.  
- Alice and Alex registered in contest 215 and the percentage is ((2/3) * 100) = 66.67%  
- Bob registered in contest 207 and the percentage is ((1/3) * 100) = 33.33%

### Solution

In [ ]:
SELECT contest_id,
    ROUND((COUNT(*) / (SELECT COUNT(*) FROM Users)) * 100, 2) AS percentage
FROM Register
GROUP BY contest_id
ORDER BY percentage DESC, contest_id

## Problem 19

*[(1211. Queries Quality and Percentage)](https://leetcode.com/problems/queries-quality-and-percentage)*

### Problem statement

Table: `Queries`

| Column Name | Type    |
|-------------|---------|
| query_name  | varchar |
| result      | varchar |
| position    | int     |
| rating      | int     |

This table may have duplicate rows.  
This table contains information collected from some queries on a database.  
The `position` column has a value from 1 to 500.  
The `rating` column has a value from 1 to 5. A query with a rating less than 3 is considered a poor query.

We define query quality as:

The average of the ratio between query rating and its position.

We also define poor query percentage as:

The percentage of all queries with rating less than 3.

Write a solution to **find each** `query_name`, **the** `quality`, **and** `poor_query_percentage`.

Both `quality` and `poor_query_percentage` should be **rounded to 2 decimal places.**

Return the result table in **any order.**

The result format is in the following example.

**Example 1:**

**Input:** 

`Queries` table:
| query_name | result           | position | rating |
|------------|------------------|----------|--------|
| Dog        | Golden Retriever | 1        | 5      |
| Dog        | German Shepherd  | 2        | 5      |
| Dog        | Mule             | 200      | 1      |
| Cat        | Shirazi          | 5        | 2      |
| Cat        | Siamese          | 3        | 3      |
| Cat        | Sphynx           | 7        | 4      |

**Output:** 
| query_name | quality | poor_query_percentage |
|------------|---------|-----------------------|
| Dog        | 2.50    | 33.33                 |
| Cat        | 0.66    | 33.33                 |

**Explanation:** 
- Dog queries quality is ((5 / 1) + (5 / 2) + (1 / 200)) / 3 = 2.50  
  Dog queries poor query percentage is (1 / 3) * 100 = 33.33%
- Cat queries quality equals ((2 / 5) + (3 / 3) + (4 / 7)) / 3 = 0.66  
  Cat queries poor query percentage is (1 / 3) * 100 = 33.33%

### Solution

In [ ]:
SELECT  query_name,
        ROUND(AVG(rating/position), 2) as quality,
        ROUND((SUM(rating < 3)/COUNT(rating) * 100),2) as poor_query_percentage
FROM Queries
GROUP BY query_name

## Problem 20

*[(1193. Monthly Transactions I)](https://leetcode.com/problems/monthly-transactions-i)*

### Problem statement

Table: `Transactions`

| Column Name | Type    |
|-------------|---------|
| id          | int     |
| country     | varchar |
| state       | enum    |
| amount      | int     |
| trans_date  | date    |

`id` is the primary key of this table.  
The table has information about incoming transactions.  
The `state` column is an enum of type ["approved", "declined"].

Write an SQL query to **find for each month and country**, the **number of transactions and their total amount**, the **number of approved transactions and their total amount**.

Return the result table in **any order**.

The query result format is in the following example.

**Example 1:**

**Input:** 

`Transactions` table:
| id   | country | state    | amount | trans_date |
|------|---------|----------|--------|------------|
| 121  | US      | approved | 1000   | 2018-12-18 |
| 122  | US      | declined | 2000   | 2018-12-19 |
| 123  | US      | approved | 2000   | 2019-01-01 |
| 124  | DE      | approved | 2000   | 2019-01-07 |

**Output:** 
| month    | country | trans_count | approved_count | trans_total_amount | approved_total_amount |
|----------|---------|-------------|----------------|--------------------|-----------------------|
| 2018-12  | US      | 2           | 1              | 3000               | 1000                  |
| 2019-01  | US      | 1           | 1              | 2000               | 2000                  |
| 2019-01  | DE      | 1           | 1              | 2000               | 2000                  |

### Solution

In [ ]:
SELECT DATE_FORMAT(trans_date, '%Y-%m') as month,
country, 
COUNT(id) as trans_count,
SUM(state = "approved") as approved_count,
SUM(amount) as trans_total_amount,
SUM(CASE WHEN state = "approved" THEN amount ELSE 0 END) as approved_total_amount 
FROM Transactions
GROUP BY country, month;

## Problem 21

*[(1174. Immediate Food Delivery II)](https://leetcode.com/problems/immediate-food-delivery-ii)*

### Problem statement

Table: `Delivery`

| Column Name                 | Type    |
|-----------------------------|---------|
| delivery_id                 | int     |
| customer_id                 | int     |
| order_date                  | date    |
| customer_pref_delivery_date | date    |

`delivery_id` is the column of unique values of this table.  
The table holds information about food delivery to customers that make orders at some date and specify a preferred delivery date (on the same order date or after it).

If the customer's preferred delivery date is the same as the order date, then the order is called immediate; otherwise, it is called scheduled.

The first order of a customer is the order with the earliest order date that the customer made. It is guaranteed that a customer has precisely one first order.

Write a solution to **find the percentage of immediate orders in the first orders of all customers, rounded to 2 decimal places**.

The result format is in the following example.

**Example:**

**Input:**

`Delivery` table:
| delivery_id | customer_id | order_date | customer_pref_delivery_date |
|-------------|-------------|------------|-----------------------------|
| 1           | 1           | 2019-08-01 | 2019-08-02                  |
| 2           | 2           | 2019-08-02 | 2019-08-02                  |
| 3           | 1           | 2019-08-11 | 2019-08-12                  |
| 4           | 3           | 2019-08-24 | 2019-08-24                  |
| 5           | 3           | 2019-08-21 | 2019-08-22                  |
| 6           | 2           | 2019-08-11 | 2019-08-13                  |
| 7           | 4           | 2019-08-09 | 2019-08-09                  |

**Output:** 
| immediate_percentage |
|----------------------|
| 50.00                |

**Explanation:**  
- The customer id 1 has a first order with delivery id 1 and it is scheduled.  
- The customer id 2 has a first order with delivery id 2 and it is immediate.  
- The customer id 3 has a first order with delivery id 5 and it is scheduled.  
- The customer id 4 has a first order with delivery id 7 and it is immediate.  

Hence, half the customers have immediate first orders.

### Solution

In [ ]:
SELECT ROUND((SUM(first_delivery_type = 'immediate')/COUNT(first_delivery_type))*100, 2) as immediate_percentage
FROM (SELECT customer_id,(CASE WHEN MIN(order_date) = MIN(customer_pref_delivery_date) THEN 'immediate' ELSE 'scheduled' END) as first_delivery_type
FROM Delivery
GROUP BY customer_id) as tempo;

**Idea**: We create a subquery to find out if first order of each client is immediate or scheduled using MIN() function. The subquery output should look like this:

| customer_id | first_delivery_type |
|-------------|---------------------|
| 1           | scheduled           |
| 2           | immediate           |
| 3           | scheduled           |
| 4           | immediate       

Then, we calculate immediate_percentage using SUM and COUNT   |    |

## Problem 22

*[(550. Game Play Analysis IV)](https://leetcode.com/problems/game-play-analysis-iv)*

### Problem statement

Table: `Activity`

| Column Name  | Type    |
|--------------|---------|
| player_id    | int     |
| device_id    | int     |
| event_date   | date    |
| games_played | int     |

`(player_id, event_date)` is the primary key (combination of columns with unique values) of this table.  
This table shows the activity of players of some games. Each row is a record of a player who logged in and played a number of games (possibly 0) before logging out on some day using some device.

Write a solution to **report the fraction of players that logged in again on the day after the day they first logged in, rounded to 2 decimal places.** In other words, you need to count the number of players that logged in for at least two consecutive days starting from their first login date, then divide that number by the total number of players.

The result format is in the following example.

**Example 1:**

**Input:**

`Activity` table:
| player_id | device_id | event_date | games_played |
|-----------|-----------|------------|--------------|
| 1         | 2         | 2016-03-01 | 5            |
| 1         | 2         | 2016-03-02 | 6            |
| 2         | 3         | 2017-06-25 | 1            |
| 3         | 1         | 2016-03-02 | 0            |
| 3         | 4         | 2018-07-03 | 5            |

**Output:**
| fraction  |
|-----------|
| 0.33      |

**Explanation:**
Only the player with id 1 logged back in after the first day he had logged in so the answer is 1/3 = 0.33

### Solution

In [ ]:
# Structure: Access second_day using a CTE, then combine with first_day. Afterward, using subquerries to calculate the ratio
SELECT 
ROUND(AVG(consecutive_login), 2) AS fraction
FROM
  (SELECT 
    (CASE WHEN DATE_ADD(first_day, INTERVAL 1 DAY) = second_day THEN 1 ELSE 0 END) AS consecutive_login
  FROM(
    SELECT
    main.player_id,
    MIN(main.event_date) AS first_day,
    (SELECT MIN(sub.event_date)
     FROM Activity sub
     WHERE sub.player_id = main.player_id
     AND sub.event_date > MIN(main.event_date)) AS second_day
FROM Activity main
GROUP BY main.player_id) AS second_day) AS consecutive

**Idea**: This process uses 3 subquerries:

Subquerry 1: Find out the second login day for each `player_id`
```
(SELECT MIN(sub.event_date)
     FROM Activity sub
     WHERE sub.player_id = main.player_id
     AND sub.event_date > MIN(main.event_date)
```
The output of this subquerry should look like this:
| player_id | second_day |
|-----------|------------|
| 1         | 2016-03-02 |
| 2         | NULL       |
| 3         | 2018-07-03 |

Subquerry 2: Find the first login day and group first and second login day to the same table
```
SELECT
    main.player_id,
    MIN(main.event_date) AS first_day,
    (SELECT MIN(sub.event_date)
     FROM Activity sub
     WHERE sub.player_id = main.player_id
     AND sub.event_date > MIN(main.event_date)) AS second_day
FROM Activity main
GROUP BY main.player_id
```
The output should look like this now
| player_id | first_day  | second_day |
|-----------|------------|------------|
| 1         | 2016-03-01 | 2016-03-02 |
| 2         | 2017-06-25 | NULL       |
| 3         | 2016-03-02 | 2018-07-03 |

Subquerry 3: Check if the player logged in on the day after the first login
```
SELECT 
    (CASE WHEN DATE_ADD(first_day, INTERVAL 1 DAY) = second_day THEN 1 ELSE 0 END) AS consecutive_login
FROM(
    SELECT
    main.player_id,
    MIN(main.event_date) AS first_day,
    (SELECT MIN(sub.event_date)
     FROM Activity sub
     WHERE sub.player_id = main.player_id
     AND sub.event_date > MIN(main.event_date)) AS second_day
FROM Activity main
GROUP BY main.player_id) AS second_day
```
The output should be:
| consecutive_login |
|-------------------|
| 1                 |
| 0                 |
| 0                 |

Main querry: Calculate the fraction as specified, the output should be:

| fraction  |
|-----------|
| 0.33      |

**Note**:

This solution from [@deepankyadav](https://leetcode.com/u/deepankyadav/) with the use of `DATE_SUB()` and `INTERVAL()` provide a shorter version:
```
SELECT
  ROUND(COUNT(DISTINCT player_id) / (SELECT COUNT(DISTINCT player_id) FROM Activity), 2) AS fraction
FROM
  Activity
WHERE
  (player_id, DATE_SUB(event_date, INTERVAL 1 DAY))
  IN (
    SELECT player_id, MIN(event_date) AS first_login FROM Activity GROUP BY player_id
    )
```
This approach also gives a boost of about 1.4 runtimes compare to the subquerries approach. More detail [here](https://leetcode.com/problems/game-play-analysis-iv/solutions/3673167/best-optimum-solution-with-explanation/).

---

# SECTION 4: SORTING AND GROUPING

## Problem 23

*[(2356. Number of Unique Subjects Taught by Each Teacher)](https://leetcode.com/problems/number-of-unique-subjects-taught-by-each-teacher)*

### Problem statement

Table: `Teacher`

| Column Name | Type |
|-------------|------|
| teacher_id  | int  |
| subject_id  | int  |
| dept_id     | int  |

`(subject_id, dept_id)` is the primary key (combinations of columns with unique values) of this table.

Each row in this table indicates that the teacher with `teacher_id` teaches the subject `subject_id` in the department `dept_id`.

Write a solution to **calculate the number of unique subjects each teacher teaches in the university.**

Return the result table in **any order.**

The result format is shown in the following example.

**Example 1:**

**Input:** 

`Teacher` table:
| teacher_id | subject_id | dept_id |
|------------|------------|---------|
| 1          | 2          | 3       |
| 1          | 2          | 4       |
| 1          | 3          | 3       |
| 2          | 1          | 1       |
| 2          | 2          | 1       |
| 2          | 3          | 1       |
| 2          | 4          | 1       |

**Output:**  
| teacher_id | cnt |
|------------|-----|
| 1          | 2   |
| 2          | 4   |

**Explanation:** 
- Teacher 1:
  - They teach subject 2 in departments 3 and 4.
  - They teach subject 3 in department 3.
- Teacher 2:
  - They teach subject 1 in department 1.
  - They teach subject 2 in department 1.
  - They teach subject 3 in department 1.
  - They teach subject 4 in department 1.

### Solution

In [ ]:
SELECT teacher_id, COUNT(DISTINCT subject_id) as cnt
FROM Teacher
GROUP BY teacher_id;

## Problem 24

*[(1141. User Activity for the Past 30 Days I)](https://leetcode.com/problems/user-activity-for-the-past-30-days-i)*

### Problem statement

Table: `Activity`

| Column Name   | Type    |
|---------------|---------|
| user_id       | int     |
| session_id    | int     |
| activity_date | date    |
| activity_type | enum    |

This table may have duplicate rows.
The `activity_type` column is an ENUM (category) of type ('open_session', 'end_session', 'scroll_down', 'send_message').
The table shows the user activities for a social media website. 
Note that each session belongs to exactly one user.

Write a solution to **find the daily active user count for a period of 30 days ending 2019-07-27 inclusively**. A user was active on some day if they made at least one activity on that day.

Return the result table in **any order.**

The result format is in the following example.

**Example 1:**

**Input:**
    
`Activity` table:
| user_id | session_id | activity_date | activity_type |
|---------|------------|---------------|---------------|
| 1       | 1          | 2019-07-20    | open_session  |
| 1       | 1          | 2019-07-20    | scroll_down   |
| 1       | 1          | 2019-07-20    | end_session   |
| 2       | 4          | 2019-07-20    | open_session  |
| 2       | 4          | 2019-07-21    | send_message  |
| 2       | 4          | 2019-07-21    | end_session   |
| 3       | 2          | 2019-07-21    | open_session  |
| 3       | 2          | 2019-07-21    | send_message  |
| 3       | 2          | 2019-07-21    | end_session   |
| 4       | 3          | 2019-06-25    | open_session  |
| 4       | 3          | 2019-06-25    | end_session   |

**Output:** 
| day        | active_users |
|------------|--------------| 
| 2019-07-20 | 2            |
| 2019-07-21 | 2            |

**Explanation:** 
Note that we do not care about days with zero active users.

### Solution

In [ ]:
SELECT activity_date as day, COUNT(DISTINCT user_id) as active_users
FROM Activity
WHERE activity_date BETWEEN DATE_SUB('2019-07-27', INTERVAL 29 DAY) AND '2019-07-27'
GROUP BY activity_date
HAVING active_users > 0;

## Problem 25

*[(1070. Product Sales Analysis III)](https://leetcode.com/problems/product-sales-analysis-iii)*

### Problem statement

Table: `Sales`

| Column Name | Type |
|-------------|------|
| sale_id     | int  |
| product_id  | int  |
| year        | int  |
| quantity    | int  |
| price       | int  |

(`sale_id`, `year`) is the primary key (combination of columns with unique values) of this table.  
`product_id` is a foreign key (reference column) to `Product` table.  
Each row of this table shows a sale on the product `product_id` in a certain `year`.
Note that the price is per unit.

Table: `Product`

| Column Name  | Type    |
|--------------|---------|
| product_id   | int     |
| product_name | varchar |

`product_id` is the primary key (column with unique values) of this table.  
Each row of this table indicates the product name of each product.

Write a solution to **select the product id, year, quantity, and price for the first year of every product sold**.

Return the resulting table in **any order**.

The result format is in the following example.

**Example 1:**

**Input:**
    
`Sales` table:
| sale_id | product_id | year | quantity | price |
|---------|------------|------|----------|-------|
| 1       | 100        | 2008 | 10       | 5000  |
| 2       | 100        | 2009 | 12       | 5000  |
| 7       | 200        | 2011 | 15       | 9000  |

`Product` table:
| product_id | product_name |
|------------|--------------|
| 100        | Nokia        |
| 200        | Apple        |
| 300        | Samsung      |

**Output:** 
| product_id | first_year | quantity | price |
|------------|------------|----------|-------|
| 100        | 2008       | 10       | 5000  |
| 200        | 2011       | 15       | 9000  |

### Solution

In [ ]:
SELECT s.product_id, f.first_year, s.quantity, s.price
FROM SALES s
INNER JOIN(
  SELECT product_id, MIN(year) AS first_year
  FROM Sales
  GROUP BY product_id) f
ON s.product_id = f.product_id AND s.year = f.first_year

**Idea**: We find first year for each product_id, then use INNER JOIN to select necessary columns. The subquerry should return the output below for Example 1:

| product_id | first_year |
|------------|------------|
| 100        | 2008       |
| 200        | 2011       |

## Problem 26

*[(596. Classes More Than 5 Students)](https://leetcode.com/problems/classes-more-than-5-students)*

### Problem statement

Table: `Courses`

| Column Name | Type    |
|-------------|---------|
| student     | varchar |
| class       | varchar |

`(student, class)` is the primary key (combination of columns with unique values) for this table.  
Each row of this table indicates the name of a student and the class in which they are enrolled.

Write a solution to **find all the classes that have at least five students**.

Return the result table in **any order**.

The result format is in the following example.

**Example 1:**

**Input:**

`Courses` table:
| student | class    |
|---------|----------|
| A       | Math     |
| B       | English  |
| C       | Math     |
| D       | Biology  |
| E       | Math     |
| F       | Computer |
| G       | Math     |
| H       | Math     |
| I       | Math     |

**Output:**  
| class |
|-------|
| Math  |

**Explanation:**  
- Math has 6 students, so we include it.
- English has 1 student, so we do not include it.
- Biology has 1 student, so we do not include it.
- Computer has 1 student, so we do not include it.

### Solution

In [ ]:
SELECT class
FROM Courses
GROUP BY class
HAVING COUNT(student) >= 5

## Problem 27

*[(1729. Find Followers Count)](https://leetcode.com/problems/find-followers-count)*

### Problem statement

Table: `Followers`

| Column Name | Type |
|-------------|------|
| user_id     | int  |
| follower_id | int  |

`(user_id, follower_id)` is the primary key (combination of columns with unique values) for this table.

This table contains the IDs of a user and a follower in a social media app where the follower follows the user.

Write a solution that will, **for each user, return the number of followers.**

Return the result table **ordered by `user_id` in ascending order.**

The result format is in the following example.

**Example 1:**

**Input:**

`Followers` table:
| user_id | follower_id |
|---------|-------------|
| 0       | 1           |
| 1       | 0           |
| 2       | 0           |
| 2       | 1           |

**Output:** 
| user_id | followers_count|
|---------|----------------|
| 0       | 1              |
| 1       | 1              |
| 2       | 2              |

**Explanation:** 
- The followers of 0 are {1}
- The followers of 1 are {0}
- The followers of 2 are {0,1}

### Solution

In [ ]:
SELECT user_id, COUNT(follower_id) AS followers_count
FROM Followers
GROUP BY user_id
ORDER BY user_id

## Problem 28

*[(619. Biggest Single Number)](https://leetcode.com/problems/biggest-single-number)*

### Problem statement

Table: `MyNumbers`

| Column Name | Type |
|-------------|------|
| num         | int  |

This table may contain duplicates (In other words, there is no primary key for this table in SQL).  
Each row of this table contains an integer.

A single number is a number that appeared only once in the `MyNumbers` table.

Find the **largest single number**. If there is no single number, report null.

The result format is in the following example.

**Example 1:**

**Input:** 

`MyNumbers` table:
| num |
|-----|
| 8   |
| 8   |
| 3   |
| 3   |
| 1   |
| 4   |
| 5   |
| 6   |

**Output:** 
| num |
|-----|
| 6   |

**Explanation:**  
The single numbers are 1, 4, 5, and 6.  
Since 6 is the largest single number, we return it.

**Example 2:**

**Input:** 

`MyNumbers` table:
| num |
|-----|
| 8   |
| 8   |
| 7   |
| 7   |
| 3   |
| 3   |
| 3   |

**Output:** 
| num  |
|------|
| null |

**Explanation:**  
There are no single numbers in the input table so we return null.

### Solution

In [ ]:
SELECT Max(num) AS num 
FROM (
  SELECT num
  FROM MyNumbers
  GROUP BY num
  HAVING COUNT(num) = 1) as tempo

**Idea**: We use subquerry to sort out single numbers only, then return the maximum value in this table. If there isn't any single number, the subquerry will return null, hence the main querry the same.

## Problem 29

*[(1045. Customers Who Bought All Products)](https://leetcode.com/problems/customers-who-bought-all-products)*

### Problem statement

Table: `Customer`

| Column Name | Type    |
|-------------|---------|
| customer_id | int     |
| product_key | int     |

This table may contain duplicate rows.  
`customer_id` is not NULL.  
`product_key` is a foreign key (reference column) to `Product` table.

Table: `Product`

| Column Name | Type    |
|-------------|---------|
| product_key | int     |

`product_key` is the primary key (column with unique values) for this table.

Write a solution to report the customer ids from the `Customer` table that **bought all the products** in the `Product` table.

Return the result table in **any order.**

The result format is in the following example.

**Example 1:**

**Input:** 

`Customer` table:
| customer_id | product_key |
|-------------|-------------|
| 1           | 5           |
| 2           | 6           |
| 3           | 5           |
| 3           | 6           |
| 1           | 6           |

`Product` table:
| product_key |
|-------------|
| 5           |
| 6           |

**Output:** 
| customer_id |
|-------------|
| 1           |
| 3           |

**Explanation:**  
The customers who bought all the products (5 and 6) are customers with IDs 1 and 3.

### Solution

In [ ]:
SELECT customer_id
FROM Customer
GROUP BY customer_id
HAVING COUNT(DISTINCT product_key) = (SELECT COUNT(product_key) FROM Product)

**Idea**: We use a subquerry in HAVING statement to retrieve the total count of `product_key` values in the `Product` table. Using the example above, the subquerry output should be:

| COUNT(product_key) |
|--------------------|
|         2          |

Then, we compare this count to the distinct count of `product_key` by `customer_id`, filtering out only those where these counts are equal. This indicates that they have purchased every product in the store.

---

# SETION 5: ADVANCED SELECT AND JOINS

## Problem 30

*[(1731. The Number of Employees Which Report to Each Employee)](https://leetcode.com/problems/the-number-of-employees-which-report-to-each-employee)*

### Problem statement

Table: `Employees`

| Column Name | Type    |
|-------------|---------|
| employee_id | int     |
| name        | varchar |
| reports_to  | int     |
| age         | int     |

`employee_id` is the column with unique values for this table.  
This table contains information about the employees and the id of the manager they report to. Some employees do not report to anyone (`reports_to` is null).

For this problem, we will consider **a manager an employee who has at least 1 other employee reporting to them.**

Write a solution to **report the ids and the names of all managers, the number of employees who report directly to them, and the average age of the reports rounded to the nearest integer.**

Return the result table **ordered by `employee_id`.**

The result format is in the following example.

**Example 1:**

**Input:** 

`Employees` table:
| employee_id | name    | reports_to | age |
|-------------|---------|------------|-----|
| 9           | Hercy   | null       | 43  |
| 6           | Alice   | 9          | 41  |
| 4           | Bob     | 9          | 36  |
| 2           | Winston | null       | 37  |

**Output:** 
| employee_id | name  | reports_count | average_age |
|-------------|-------|---------------|-------------|
| 9           | Hercy | 2             | 39          |

**Explanation:**  
Hercy has 2 people report directly to him, Alice and Bob. Their average age is (41+36)/2 = 38.5, which is 39 after rounding it to the nearest integer.

**Example 2:**

**Input:** 

`Employees` table:
| employee_id | name    | reports_to | age |
|-------------|---------|------------|-----|
| 1           | Michael | null       | 45  |
| 2           | Alice   | 1          | 38  |
| 3           | Bob     | 1          | 42  |
| 4           | Charlie | 2          | 34  |
| 5           | David   | 2          | 40  |
| 6           | Eve     | 3          | 37  |
| 7           | Frank   | null       | 50  |
| 8           | Grace   | null       | 48  |

**Output:** 
| employee_id | name    | reports_count | average_age |
|-------------|---------|---------------|-------------|
| 1           | Michael | 2             | 40          |
| 2           | Alice   | 2             | 37          |
| 3           | Bob     | 1             | 37          |

### Solution

In [ ]:
SELECT  e1.employee_id, 
        e1.name, 
        COUNT(e2.reports_to) AS reports_count, 
        ROUND(AVG(e2.age)) as average_age
FROM Employees e1
INNER JOIN Employees e2 ON e1.employee_id = e2.reports_to
GROUP BY e1.employee_id
ORDER BY employee_id

**Idea**: We use INNER JOIN to summarize who report to who, and also to exclude `NULL` in reports_to. Once this is done, basically we would have employee_id of mangager, as they need at least 1 `reports_count` taking form `reports_to`, respected to the definition in Problem statement. The `average_age` is then simply calculated as specify. (We treats `e1` table as manager table, and `e2` table as employee table, noted that a manager can also be an employee of his/her N+1)

## Problem 31

*[(1789. Primary Department for Each Employee)](https://leetcode.com/problems/primary-department-for-each-employee)*

### Problem statement

Table: `Employee`

| Column Name   | Type    |
|---------------|---------|
| employee_id   | int     |
| department_id | int     |
| primary_flag  | varchar |

`(employee_id, department_id)` is the primary key (combination of columns with unique values) for this table.  
`employee_id` is the id of the employee.  
`department_id` is the id of the department to which the employee belongs.  
`primary_flag` is an ENUM (category) of type ('Y', 'N'). If the flag is 'Y', the department is the primary department for the employee. If the flag is 'N', the department is not the primary.  

Employees can belong to multiple departments. When the employee joins other departments, they need to decide which department is their primary department. Note that when an employee belongs to only one department, their primary column is 'N'.

Write a solution to **report all the employees with their primary department.** For employees who belong to one department, report their only department.

Return the result table in **any order.**

The result format is in the following example.

**Example 1:**

**Input:** 

`Employee` table:
| employee_id | department_id | primary_flag |
|-------------|---------------|--------------|
| 1           | 1             | N            |
| 2           | 1             | Y            |
| 2           | 2             | N            |
| 3           | 3             | N            |
| 4           | 2             | N            |
| 4           | 3             | Y            |
| 4           | 4             | N            |

**Output:** 
| employee_id | department_id |
|-------------|---------------|
| 1           | 1             |
| 2           | 1             |
| 3           | 3             |
| 4           | 3             |

### Solution

In [ ]:
# Choose all employees with only 1 department
SELECT employee_id, department_id
FROM Employee
GROUP BY employee_id
HAVING COUNT(*) = 1
# Group with
UNION
# Employees with the line where indicated their primary department
SELECT employee_id, department_id
FROM Employee
WHERE primary_flag = 'Y';

**Idea**: We filter out the employees seperatedly in two cases, then gather them up using UNION. Those who only has 1 department can be filtered out using `GROUP BY` and `HAVING COUNT(*) = 1`, while the others are filtered out using `WHERE primary_flag = 'Y'`.

## Problem 32

*[(610. Triangle Judgement)](https://leetcode.com/problems/triangle-judgement)*

### Problem statement

Table: `Triangle`

| Column Name | Type |
|-------------|------|
| x           | int  |
| y           | int  |
| z           | int  |

In SQL, `(x, y, z)` is the primary key column for this table.
Each row of this table contains the lengths of three line segments.

Report for every three line segments whether they **can form a triangle.**

Return the result table in **any order.**

The result format is in the following example.

**Example 1:**

**Input:** 

`Triangle` table:
| x  | y  | z  |
|----|----|----|
| 13 | 15 | 30 |
| 10 | 20 | 15 |

**Output:** 
| x  | y  | z  | triangle |
|----|----|----|----------|
| 13 | 15 | 30 | No       |
| 10 | 20 | 15 | Yes      |

### Solution

In [ ]:
SELECT  x, y, z,
        (CASE WHEN x+y>z AND x+z>y AND y+z>x THEN 'Yes' ELSE 'No' END) as triangle
FROM Triangle

## Problem 33

*[(180. Consecutive Numbers)](https://leetcode.com/problems/consecutive-numbers)*

### Problem statement

Table: `Logs`

| Column Name | Type    |
|-------------|---------|
| id          | int     |
| num         | varchar |

In SQL, `id` is the primary key for this table.  
`id` is an autoincrement column.

Find all numbers that **appear at least three times consecutively.**

Return the result table in **any order.**

The result format is in the following example.

**Example 1:**

**Input:** 

`Logs` table:
| id | num |
|----|-----|
| 1  | 1   |
| 2  | 1   |
| 3  | 1   |
| 4  | 2   |
| 5  | 1   |
| 6  | 2   |
| 7  | 2   |

**Output:** 
| ConsecutiveNums |
|-----------------|
| 1               |

**Explanation:**  
1 is the only number that appears consecutively for at least three times.

### Solution

In [ ]:
WITH list_3_num AS
(SELECT
    id,
    num,
    LEAD(num, 1) OVER (ORDER BY id) AS nextnum_1,
    LEAD(num, 2) OVER (ORDER BY id) AS nextnum_2
FROM Logs)
SELECT DISTINCT num AS ConsecutiveNums
FROM list_3_num
WHERE num = nextnum_1 AND nextnum_1 = nextnum_2;

**Idea**: Two math problems in a row, interesting! In here we use `LEAD()` to SHIFT each number by 1 and 2 place, respectively. Afterward, we keep only distinct values of those who met the condition that value in position N equal the value in N+1 and N+2 place.  
More precisely, the subquerry will return this output:

| id | num | nextnum_1 | nextnum_2 |
|----|-----|-----------|-----------|
| 1  | 1   | 1         | 1         |
| 2  | 1   | 1         | 1         |
| 3  | 1   | 1         | 2         |
| 4  | 2   | 1         | 1         |
| 5  | 1   | 1         | 2         |
| 6  | 2   | 2         | null      |
| 7  | 2   | null      | null      |

The `id` correspond to the place.  
Taking `id = 1` for example, the `nextnum_1` is value of num at `id = 2`, and `nextnum_2` is `value` of num at `id = 3`.   As the `id = 8` doesn't exist, the `nextnum_2` of `id = 6` is `NULL`. Same logic applies to `nextnum_1` and `nextnum_2`of `id = 7`.  
Finally, we just need to filter out distinct number with `num = nextnum_1 = nextnum_2`.

## Problem 34

*[(1164. Product Price at a Given Date)](https://leetcode.com/problems/product-price-at-a-given-date)*

### Problem statement

Table: `Products`

| Column Name | Type    |
|-------------|---------|
| product_id  | int     |
| new_price   | int     |
| change_date | date    |

`(product_id, change_date)` is the primary key (combination of columns with unique values) of this table.  
Each row of this table indicates that the price of some product was changed to a new price at some date.

Write a solution to find the **prices of all products on 2019-08-16.** Assume the price of all products before any change is 10.

Return the result table in **any order.**

The result format is in the following example.

**Example 1:**

**Input:**

`Products` table:
| product_id | new_price | change_date |
|------------|-----------|-------------|
| 1          | 20        | 2019-08-14  |
| 2          | 50        | 2019-08-14  |
| 1          | 30        | 2019-08-15  |
| 1          | 35        | 2019-08-16  |
| 2          | 65        | 2019-08-17  |
| 3          | 20        | 2019-08-18  |

**Output:** 
| product_id | price |
|------------|-------|
| 2          | 50    |
| 1          | 35    |
| 3          | 10    |

### Solution

In [ ]:
WITH ProductsCTE AS
(
    -- Create starting price as 10 for every products
SELECT DISTINCT
    product_id,
    10 AS new_price,
    DATE_SUB((SELECT MIN(change_date) FROM Products), INTERVAL 1 DAY) AS change_date
FROM
    Products
-- Using UNION to merge this to Products table
UNION ALL
SELECT 
    product_id,
    new_price,
    change_date
FROM 
    Products
-- Remove change_date after the selected date
WHERE 
    change_date <= '2019-08-16'
)
-- From the new table, rank each line by the descending date, partition by product, then select only first row (date closest to selected date)
SELECT 
    product_id,
    new_price AS price
FROM 
    (SELECT 
        product_id,
        change_date,
        new_price,
        ROW_NUMBER() OVER (PARTITION BY product_id ORDER BY change_date DESC) AS row_num
     FROM 
        ProductsCTE
    ) AS tempo
WHERE 
    row_num = 1;

**Idea**: 

Step 1:
Using CTE, we first modify the `Products` table as below:
- Adding starting price as 10 with the date as the oldest one from `Products` table minus one, which means we have `2019-08-13` for the example above
- Remove all rows with change_date after the selected date `2019-08-16`.

The output, named `ProductsCTE` should be:

| product_id | new_price | change_date |
| ---------- | --------- | ----------- |
| 1          | 10        | 2019-08-13  |
| 2          | 10        | 2019-08-13  |
| 3          | 10        | 2019-08-13  |
| 1          | 20        | 2019-08-14  |
| 2          | 50        | 2019-08-14  |
| 1          | 30        | 2019-08-15  |
| 1          | 35        | 2019-08-16  |

Step 2: From here, we rank the rows by the most recent (descending order) on a partition defined by `product_id`, this step is written under the subquerry `tempo`, using 2 functions `ROW_NUMBER()` and `PARTITION BY`, and the output should look like:

| product_id | change_date | new_price | row_num |
| ---------- | ----------- | --------- | ------- |
| 1          | 2019-08-16  | 35        | 1       |
| 1          | 2019-08-15  | 30        | 2       |
| 1          | 2019-08-14  | 20        | 3       |
| 1          | 2019-08-13  | 10        | 4       |
| 2          | 2019-08-14  | 50        | 1       |
| 2          | 2019-08-13  | 10        | 2       |
| 3          | 2019-08-13  | 10        | 1       |

Step 3: Finally, we keep only first row for each product (ie: `row_num = 1`), which represent lastest price on selected date.

## Problem 35

*[(1204. Last Person to Fit in the Bus)](https://leetcode.com/problems/last-person-to-fit-in-the-bus)*

### Problem statement

Table: `Queue`

| Column Name | Type    |
|-------------|---------|
| person_id   | int     |
| person_name | varchar |
| weight      | int     |
| turn        | int     |

`person_id` column contains unique values.  
This table has the information about all people waiting for a bus.  
The `person_id` and `turn` columns will contain all numbers from 1 to n, where n is the number of rows in the table.  
`turn` determines the order in which people will board the bus, where `turn=1` denotes the first person to board and `turn=n` denotes the last person to board.  
`weight` is the weight of the person in kilograms.

There is a queue of people waiting to board a bus. However, the bus has a weight limit of 1000 kilograms, so there may be some people who cannot board.

Write a solution to **find the** `person_name` **of the last person that can fit on the bus without exceeding the weight limit.**  
The test cases are generated such that the first person does not exceed the weight limit.

The result format is in the following example.

**Example 1:**

**Input:**

`Queue` table:
| person_id | person_name | weight | turn |
|-----------|-------------|--------|------|
| 5         | Alice       | 250    | 1    |
| 4         | Bob         | 175    | 5    |
| 3         | Alex        | 350    | 2    |
| 6         | John Cena   | 400    | 3    |
| 1         | Winston     | 500    | 6    |
| 2         | Marie       | 200    | 4    |

**Output:** 
| person_name |
|-------------|
| John Cena   |

**Explanation:** 
The following table is ordered by the turn for simplicity.
| Turn | ID | Name      | Weight | Total Weight |
|------|----|-----------|--------|--------------|
| 1    | 5  | Alice     | 250    | 250          |
| 2    | 3  | Alex      | 350    | 600          |
| 3    | 6  | John Cena | 400    | 1000 (last boardable)| 
| 4    | 2  | Marie     | 200    | 1200 (cannot board)  | 
| 5    | 4  | Bob       | 175    | ___          |
| 6    | 1  | Winston   | 500    | ___          |

### Solution

In [ ]:
WITH total_weight AS(
SELECT
  turn,
  person_id,
  person_name,
  weight,
  SUM(weight) OVER (ORDER BY turn ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW) AS total_weight
FROM
  Queue
ORDER BY turn)
SELECT person_name
FROM total_weight
WHERE total_weight <= 1000 
ORDER BY turn DESC
LIMIT 1;

**Idea**: 
- We use CTE `total_weight` to reorder passengers to their right turn, then calculating the rolling sum of weight:

| turn | person_id | person_name | weight | total_weight |
| ---- | --------- | ----------- | ------ | ------------ |
| 1    | 5         | Alice       | 250    | 250          |
| 2    | 3         | Alex        | 350    | 600          |
| 3    | 6         | John Cena   | 400    | 1000         |
| 4    | 2         | Marie       | 200    | 1200         |
| 5    | 4         | Bob         | 175    | 1375         |
| 6    | 1         | Winston     | 500    | 1875         |

- From this table, we filter boarded passengers using `WHERE total_weight <= 1000`, sort the result by descending `turn` to and `LIMIT 1` (show only first row) to show the last person who boarded.

## Problem 36

*[(1907. Count Salary Categories)](https://leetcode.com/problems/count-salary-categories)*

### Problem statement

Table: `Accounts`

| Column Name | Type |
|-------------|------|
| account_id  | int  |
| income      | int  |

`account_id` is the primary key (column with unique values) for this table.  
Each row contains information about the monthly income for one bank account.

Write a solution to **calculate the number of bank accounts for each salary category.** The salary categories are:
- "Low Salary": All the salaries strictly less than \$ 20000.
- "Average Salary": All the salaries in the inclusive range [\\$20000, \\$50000].
- "High Salary": All the salaries strictly greater than \$50000.

The result table must contain all three categories. If there are no accounts in a category, return 0.

Return the result table in **any order.**

The result format is in the following example.

**Example 1:**

**Input:**

`Accounts` table:
| account_id | income |
|------------|--------|
| 3          | 108939 |
| 2          | 12747  |
| 8          | 87709  |
| 6          | 91796  |

**Output:** 
| category       | accounts_count |
|----------------|----------------|
| Low Salary     | 1              |
| Average Salary | 0              |
| High Salary    | 3              |

**Explanation:**

- Low Salary: Account 2.
- Average Salary: No accounts.
- High Salary: Accounts 3, 6, and 8.

### Solution

In [ ]:
SELECT
    'Low Salary' AS category,
    SUM(CASE WHEN income < 20000 THEN 1 ELSE 0 END) AS accounts_count
FROM Accounts
UNION ALL
SELECT
    'Average Salary' AS category,
    SUM(CASE WHEN income >= 20000 AND income <= 50000 THEN 1 ELSE 0 END) AS accounts_count
FROM Accounts
UNION ALL
SELECT
    'High Salary' AS category,
    SUM(CASE WHEN income > 50000 THEN 1 ELSE 0 END) AS accounts_count
FROM Accounts;

---

# SECTION 6: SUBQUERRIES

## Problem 37

*[(1978. Employees Whose Manager Left the Company)](https://leetcode.com/problems/employees-whose-manager-left-the-company)*

### Problem statement

Table: `Employees`

| Column Name | Type    |
|-------------|---------|
| employee_id | int     |
| name        | varchar |
| manager_id  | int     |
| salary      | int     |

In SQL, `employee_id` is the primary key for this table.  
This table contains information about the employees, their salary, and the ID of their manager.  
Some employees do not have a manager (`manager_id` is null).  
When a manager leaves the company, their information is deleted from the Employees table, but the reports still have their `manager_id` set to the manager that left.

Find the IDs of the employees whose **salary is strictly less than $30000** and whose **manager left the company.**  


Return the result table **ordered by** `employee_id`.

The result format is in the following example.

**Example 1:**

**Input:**  
`Employees` table:
| employee_id | name      | manager_id | salary |
|-------------|-----------|------------|--------|
| 3           | Mila      | 9          | 60301  |
| 12          | Antonella | null       | 31000  |
| 13          | Emery     | null       | 67084  |
| 1           | Kalel     | 11         | 21241  |
| 9           | Mikaela   | null       | 50937  |
| 11          | Joziah    | 6          | 28485  |

**Output:** 
| employee_id |
|-------------|
| 11          |

**Explanation:** 

- The employees with a salary less than $30000 are 1 (Kalel) and 11 (Joziah).
- Kalel's manager is employee 11, who is still in the company (Joziah).
- Joziah's manager is employee 6, who left the company because there is no row for employee 6 as it was deleted.

### Solution

In [ ]:
SELECT employee_id
FROM(
SELECT e1.employee_id, e1.salary s1, e2.salary s2, e1.manager_id
FROM Employees e1
LEFT JOIN Employees e2 ON e2.employee_id = e1.manager_id) as tempo
WHERE s1 < 30000 AND s2 IS NULL AND manager_id IS NOT NULL
ORDER BY employee_id

**Idea**: 
First, we use `LEFT JOIN` to add manager salary (`s2`) for each `employee_id`. If a manager left, their salary in s2 will be `NULL`.

| employee_id | s1    | s2    | manager_id |
| ----------- | ----- | ----- | ---------- |
| 3           | 60301 | 50937 | 9          |
| 12          | 31000 | null  | null       |
| 13          | 67084 | null  | null       |
| 1           | 21241 | 28485 | 11         |
| 9           | 50937 | null  | null       |
| 11          | 28485 | null  | 6    

Afterward, we filter the table as specified condition, using `s1 < 30000` as employee salary, and `s2 IS NULL` represent that his/her manager left.      |

## Problem 38

*[(626. Exchange Seats)](https://leetcode.com/problems/exchange-seats)*

### Problem statement

Table: `Seat`

| Column Name | Type    |
|-------------|---------|
| id          | int     |
| student     | varchar |

`id` is the primary key (unique value) column for this table.
Each row of this table indicates the name and the ID of a student.
`id` is a continuous increment.

Write a solution to **swap the seat id of every two consecutive students.**  
If the number of students is odd, the id of the last student is not swapped.

Return the result table **ordered by** `id` **in ascending order.**

The result format is in the following example.

**Example 1:**

**Input:**  
`Seat` table:
| id | student |
|----|---------|
| 1  | Abbot   |
| 2  | Doris   |
| 3  | Emerson |
| 4  | Green   |
| 5  | Jeames  |

**Output:** 
| id | student |
|----|---------|
| 1  | Doris   |
| 2  | Abbot   |
| 3  | Green   |
| 4  | Emerson |
| 5  | Jeames  |

**Explanation:** 
Note that if the number of students is odd, there is no need to change the last one's seat.

### Solution

In [ ]:
SELECT
    CASE
        WHEN (id = (SELECT COUNT(*) FROM Seat) AND id % 2 = 1 )THEN id -- last student is odd, then no change.
        WHEN id % 2 = 0 THEN id - 1 -- even id change to previous odd
        ELSE id + 1 -- odd id change to next even
    END AS id, 
    student
FROM Seat
ORDER BY id;

## Problem 39

*[(1341. Movie Rating)](https://leetcode.com/problems/movie-rating)*

### Problem statement

Table: `Movies`

| Column Name | Type    |
|-------------|---------|
| movie_id    | int     |
| title       | varchar |

`movie_id` is the primary key (column with unique values) for this table.
`title` is the name of the movie.

Table: `Users`

| Column Name | Type    |
|-------------|---------|
| user_id     | int     |
| name        | varchar |

`user_id` is the primary key (column with unique values) for this table.

Table: `MovieRating`

| Column Name | Type    |
|-------------|---------|
| movie_id    | int     |
| user_id     | int     |
| rating      | int     |
| created_at  | date    |

`(movie_id, user_id)` is the primary key (column with unique values) for this table.
This table contains the rating of a movie by a user in their review.
`created_at` is the user's review date.

Write a solution to:

1. Find the name of the user who has rated the greatest number of movies. In case of a tie, return the lexicographically smaller user name.
2. Find the movie name with the highest average rating in February 2020. In case of a tie, return the lexicographically smaller movie name.

The result format is in the following example.

**Example 1:**

**Input:**  
`Movies` table:
| movie_id | title    |
|----------|----------|
| 1        | Avengers |
| 2        | Frozen 2 |
| 3        | Joker    |

`Users` table:
| user_id | name   |
|---------|--------|
| 1       | Daniel |
| 2       | Monica |
| 3       | Maria  |
| 4       | James  |

`MovieRating` table:
| movie_id | user_id | rating | created_at |
|----------|---------|--------|------------|
| 1        | 1       | 3      | 2020-01-12 |
| 1        | 2       | 4      | 2020-02-11 |
| 1        | 3       | 2      | 2020-02-12 |
| 1        | 4       | 1      | 2020-01-01 |
| 2        | 1       | 5      | 2020-02-17 |
| 2        | 2       | 2      | 2020-02-01 |
| 2        | 3       | 2      | 2020-03-01 |
| 3        | 1       | 3      | 2020-02-22 |
| 3        | 2       | 4      | 2020-02-25 |

**Output:** 
| results  |
|----------|
| Daniel   |
| Frozen 2 |

**Explanation:**  
- Daniel and Monica have rated 3 movies ("Avengers", "Frozen 2" and "Joker") but Daniel is smaller lexicographically.
- "Frozen 2" and "Joker" have a rating average of 3.5 in February but "Frozen 2" is smaller lexicographically.

In [ ]:
# Code structure:
# UNION 2 querry: 
# 1 for name of the user who has rated the greatest number of movies
# 1 for the movie name with the highest average rating in February 2020

(WITH top_rank AS(
SELECT user_id 
FROM(
SELECT user_id, RANK() OVER (ORDER BY rating_counts DESC) as rt
FROM(
SELECT user_id, COUNT(rating) AS rating_counts
FROM MovieRating
GROUP BY user_id) as r_count) as r_rank
WHERE rt = 1)
SELECT u.name as results
FROM top_rank tr
LEFT JOIN Users u ON tr.user_id = u.user_id
ORDER BY u.name
LIMIT 1)
UNION ALL -- to avoid same movie and user name, use UNION ALL instead of UNION
(WITH top_rating AS (
    SELECT 
        movie_id,
        AVG(rating) AS avg_rating
    FROM MovieRating
    WHERE YEAR(created_at) = 2020 AND MONTH(created_at) = 2
    GROUP BY movie_id
)
SELECT m.title AS results
FROM
(SELECT  
    movie_id,
    avg_rating,
    RANK() OVER (ORDER BY avg_rating DESC) AS rnk
FROM top_rating
ORDER BY rnk DESC) as mr
LEFT JOIN Movies m ON mr.movie_id = m.movie_id 
WHERE mr.rnk = 1
ORDER BY m.title
LIMIT 1)

**Idea**:

- The querry before the `UNION ALL` aims to find the name of the user who has rated the greatest number of movies.
    - Firstly, we use `(COUNT(rating) AS rating_counts)` and GROUPBY user_id.
    - Secondly, we use `(RANK() OVER (ORDER BY rating_counts DESC) as rt)` to rank users by rating counts.
    - Thirdly, we use `LEFT JOIN` with `Users` table to find his/her name from `user_id`.
    - Finally, we keep only the user with rank 1.
- The querry after the `UNION ALL` aims to find the movie name with the highest average rating in February 2020.
    - Firstly, we calculate the average rating for each movie in February 2020 using `AVG()`, `YEAR()` and `MONTH()`.
    -  Secondly, we rank the movies based on their average rating with similar function as first part.
    -  Thirdly, we use `LEFT JOIN` to find movie name from `movie_id`.
    - Finally, we keep only the user with rank 1
      
At the end, we merge these two querries using `UNION ALL`

## Problem 40

*[(1321. Restaurant Growth)](https://leetcode.com/problems/restaurant-growth)*

### Problem statement

Table: `Customer`

| Column Name | Type    |
|-------------|---------|
| customer_id | int     |
| name        | varchar |
| visited_on  | date    |
| amount      | int     |

In SQL, `(customer_id, visited_on)` is the primary key for this table.  
This table contains data about customer transactions in a restaurant.  
`visited_on` is the date on which the customer with ID `customer_id` has visited the restaurant.  
`amount` is the total paid by a customer.  

You are the restaurant owner and you want to analyze a possible expansion (there will be at least one customer every day). Compute the moving average of how much the **customer paid in a seven days window** (i.e., current day + 6 days before). `average_amount` should be rounded to two decimal places.

Return the result table **ordered by** `visited_on` **in ascending order.**

The result format is in the following example.

**Example:**

**Input:**
`Customer` table:
| customer_id | name    | visited_on | amount |
|-------------|---------|------------|--------|
| 1           | Jhon    | 2019-01-01 | 100    |
| 2           | Daniel  | 2019-01-02 | 110    |
| 3           | Jade    | 2019-01-03 | 120    |
| 4           | Khaled  | 2019-01-04 | 130    |
| 5           | Winston | 2019-01-05 | 110    |
| 6           | Elvis   | 2019-01-06 | 140    |
| 7           | Anna    | 2019-01-07 | 150    |
| 8           | Maria   | 2019-01-08 | 80     |
| 9           | Jaze    | 2019-01-09 | 110    |
| 1           | Jhon    | 2019-01-10 | 130    |
| 3           | Jade    | 2019-01-10 | 150    |

Output: 
| visited_on | amount | average_amount |
|------------|--------|----------------|
| 2019-01-07 | 860    | 122.86         |
| 2019-01-08 | 840    | 120            |
| 2019-01-09 | 840    | 120            |
| 2019-01-10 | 1000   | 142.86         |

**Explanation:**
- 1st moving average from 2019-01-01 to 2019-01-07 has an average_amount of (100 + 110 + 120 + 130 + 110 + 140 + 150)/7 = 122.86
- 2nd moving average from 2019-01-02 to 2019-01-08 has an average_amount of (110 + 120 + 130 + 110 + 140 + 150 + 80)/7 = 120
- 3rd moving average from 2019-01-03 to 2019-01-09 has an average_amount of (120 + 130 + 110 + 140 + 150 + 80 + 110)/7 = 120
- 4th moving average from 2019-01-04 to 2019-01-10 has an average_amount of (130 + 110 + 140 + 150 + 80 + 110 + 130 + 150)/7 = 142.86

### Solution

In [ ]:
SELECT *
FROM(
SELECT 
    visited_on,
    # Sum of daily amount last 6 days + today
    SUM(daily_amount) OVER (
        ORDER BY visited_on
        RANGE BETWEEN INTERVAL 6 DAY PRECEDING AND CURRENT ROW
    ) AS amount,
    # Same idea, with a notice that the average should be /7 and not AVG() as the AVG() will divide the sum by number of rows
    ROUND(SUM(daily_amount) OVER (
        ORDER BY visited_on
        RANGE BETWEEN INTERVAL 6 DAY PRECEDING AND CURRENT ROW
    )/7, 2) AS average_amount
FROM(
SELECT
    visited_on,
    SUM(amount) AS daily_amount     
FROM Customer
GROUP BY visited_on
ORDER BY visited_on) as d_amount) AS all_date
# Filter our first 6 days
WHERE visited_on >= (SELECT DATE_ADD(MIN(visited_on), INTERVAL 6 DAY) FROM Customer);

**Idea**:
- First we calculate daily sales, using the CTE and called it `d_amount`:
```
SELECT
    visited_on,
    SUM(amount) AS daily_amount     
FROM Customer
GROUP BY visited_on
ORDER BY visited_on)
```

| visited_on | daily_amount |
| ---------- | ------------ |
| 2019-01-01 | 100          |
| 2019-01-02 | 110          |
| 2019-01-03 | 120          |
| 2019-01-04 | 130          |
| 2019-01-05 | 110          |
| 2019-01-06 | 140          |
| 2019-01-07 | 150          |
| 2019-01-08 | 80           |
| 2019-01-09 | 110          |
| 2019-01-10 | 280

- Secondly, we calculate 7-day rolling sales and named it `amount`: 
```
SUM(daily_amount) OVER (
        ORDER BY visited_on
        RANGE BETWEEN INTERVAL 6 DAY PRECEDING AND CURRENT ROW
    )
```

- Thirdly, we calculate rolling 7-days average and named it `average_amount`. Noted that the average_amount supposed to be the total amount divided by 7 days, and not using AVG() as it will divide by number of rows:
```
ROUND(SUM(daily_amount) OVER (
        ORDER BY visited_on
        RANGE BETWEEN INTERVAL 6 DAY PRECEDING AND CURRENT ROW
    )/7, 2) AS average_amount
```
- Finally, we filter out first 6 days which contains `NULL` for rolling sum calculation.          |

## Problem 41

*[(602. Friend Requests II: Who Has the Most Friends)](https://leetcode.com/problems/friend-requests-ii-who-has-the-most-friends)*

### Problem statement

Table: `RequestAccepted`

| Column Name  | Type  |
|--------------|-------|
| requester_id | int   |
| accepter_id  | int   |
| accept_date  | date  |

In SQL, `(requester_id, accepter_id)` is the primary key for this table.  
This table contains the ID of the user who sent the request, the ID of the user who received the request, and the date when the request was accepted.

Write a solution to **find the people who have the most friends and the most friends number.**

The test cases are generated so that only one person has the most friends.

The result format is in the following example.

**Example:**

**Input:**  
`RequestAccepted` table:
| requester_id | accepter_id | accept_date |
|--------------|-------------|-------------|
| 1            | 2           | 2016/06/03  |
| 1            | 3           | 2016/06/08  |
| 2            | 3           | 2016/06/08  |
| 3            | 4           | 2016/06/09  |

**Output:** 
| id | num |
|----|-----|
| 3  | 3   |

**Explanation:**  
The person with id 3 is a friend of people 1, 2, and 4, so he has three friends in total, which is the most number than any others.

### Solution

In [ ]:
SELECT 
    id,
    COUNT(id) AS num    
FROM
(
    SELECT 
        requester_id AS id
    FROM  
        RequestAccepted 
    UNION ALL
    (
    SELECT
        accepter_id AS id
    FROM 
        RequestAccepted
    )
) AS rq_ac
GROUP BY id
ORDER BY num DESC
LIMIT 1

**Idea**: To find all friends of a person, we have to count both request and accept rows where his/her id appear. Here we use the `UNION ALL` to construct a list of all id appear in both columns, then count and sort in descending order. Finally, `LIMIT` the result to only first row.

## Problem 42

*[(585. Investments in 2016)](https://leetcode.com/problems/investments-in-2016)*

### Problem statement

Table: `Insurance`

| Column Name | Type  |
|-------------|-------|
| pid         | int   |
| tiv_2015    | float |
| tiv_2016    | float |
| lat         | float |
| lon         | float |

pid is the primary key (column with unique values) for this table.  
Each row of this table contains information about one policy where:  
`pid` is the policyholder's policy ID.  
`tiv_2015` is the total investment value in 2015 and tiv_2016 is the total investment value in 2016.  
`lat` is the latitude of the policy holder's city. It's guaranteed that lat is not `NULL`.
`lon` is the longitude of the policy holder's city. It's guaranteed that lon is not `NULL`.

Write a solution to report the sum of all total investment values in 2016 `tiv_2016`, for all policyholders who:
- have the same `tiv_2015` value as one or more other policyholders, and
- are not located in the same city as any other policyholder (i.e., the (`lat`, `lon`) attribute pairs must be unique).

Round `tiv_2016` to two decimal places.

**Example:**

**Input:**   
`Insurance` table:
| pid | tiv_2015 | tiv_2016 | lat | lon |
|-----|----------|----------|-----|-----|
| 1   | 10       | 5        | 10  | 10  |
| 2   | 20       | 20       | 20  | 20  |
| 3   | 10       | 30       | 20  | 20  |
| 4   | 10       | 40       | 40  | 40  |

**Output:** 
| tiv_2016 |
|----------|
| 45.00    |

**Explanation:** 
- The first record in the table, like the last record, meets both of the two criteria. The `tiv_2015` value 10 is the same as the third and fourth records, and its location is unique.
- The second record does not meet any of the two criteria. Its `tiv_2015` is not like any other policyholders and its location is the same as the third record, which makes the third record fail, too.

So, the result is the sum of tiv_2016 of the first and last record, which is 45.

### Solution

In [ ]:
# Code structure: 
# First, filter out all lon-lat which has at least one duplicate
# Secondly, SUM(tiv_2016) GROUP BY tiv_2015 ON a subset of Insurance which only take tiv_2015 with at least one duplicate.

SELECT ROUND(SUM(tiv_2016), 2) AS tiv_2016
FROM
(WITH unique_location AS(
SELECT 
    pid, tiv_2015, tiv_2016,    
    CONCAT(lat, lon) AS geo_data
FROM 
    Insurance
GROUP BY 
    geo_data
HAVING 
    COUNT(*) = 1
)
SELECT SUM(tiv_2016) AS tiv_2016
FROM unique_location
WHERE tiv_2015 IN (
    SELECT tiv_2015
    FROM Insurance
    GROUP BY tiv_2015
    HAVING COUNT(tiv_2015) > 1)
GROUP BY tiv_2015) AS sum_by_tiv_2015

**Idea**:
- First condition: starting from the `unique_location` CTE which filter out only rows that meet the condition 1:
```
SELECT 
    pid, tiv_2015, tiv_2016,    
    CONCAT(lat, lon) AS geo_data
FROM 
    Insurance
GROUP BY 
    geo_data
HAVING 
    COUNT(*) = 1
```
This code will return the output:

| pid | tiv_2015 | tiv_2016 | geo_data |
| --- | -------- | -------- | -------- |
| 1   | 10       | 5        | 1010     |
| 4   | 10       | 40       | 4040   

- Second condition: We use a subquerry:
```
SELECT tiv_2015
FROM Insurance
GROUP BY tiv_2015
HAVING COUNT(tiv_2015) > 1
```
The output of this subquerry return all the tiv_2015 that appears more than one, which help us verify the 2nd condition by using `tiv_2015 IN`. For our example, only the `tiv_2015 = 10` met this requirement.

| tiv_2015 |
| -------- |
| 10       |

- Finally, we calculate `SUM(tiv_2016)` and round them to 2 decimal places.

## Problem 43

*[(185. Department Top Three Salaries)](https://leetcode.com/problems/department-top-three-salaries)*

### Problem statement

Table: `Employee`

| Column Name  | Type    |
|--------------|---------|
| id           | int     |
| name         | varchar |
| salary       | int     |
| departmentId | int     |

`id` is the primary key (column with unique values) for this table.  
`departmentId` is a foreign key (reference column) of the ID from the Department table.  
Each row of this table indicates the ID, name, and salary of an employee. It also contains the ID of their department.

Table: `Department`

| Column Name | Type    |
|-------------|---------|
| id          | int     |
| name        | varchar |

`id` is the primary key (column with unique values) for this table.  
Each row of this table indicates the ID of a department and its name.

A company's executives are interested in seeing who earns the most money in each of the company's departments. A high earner in a department is an employee who has a salary in the top three unique salaries for that department.

Write a solution to **find the employees who are high earners in each of the departments.**

Return the result table in **any order.**

The result format is in the following example.

Example 1:

**Input:**  
`Employee` table:
| id | name  | salary | departmentId |
|----|-------|--------|--------------|
| 1  | Joe   | 85000  | 1            |
| 2  | Henry | 80000  | 2            |
| 3  | Sam   | 60000  | 2            |
| 4  | Max   | 90000  | 1            |
| 5  | Janet | 69000  | 1            |
| 6  | Randy | 85000  | 1            |
| 7  | Will  | 70000  | 1            |

`Department` table:
| id | name  |
|----|-------|
| 1  | IT    |
| 2  | Sales |

**Output:**  
| Department | Employee | Salary |
|------------|----------|--------|
| IT         | Max      | 90000  |
| IT         | Joe      | 85000  |
| IT         | Randy    | 85000  |
| IT         | Will     | 70000  |
| Sales      | Henry    | 80000  |
| Sales      | Sam      | 60000  |

**Explanation:** 
- In the IT department:
  - Max earns the highest unique salary
  - Both Randy and Joe earn the second-highest unique salary
  - Will earns the third-highest unique salary
- In the Sales department:
  - Henry earns the highest salary
  - Sam earns the second-highest salary
  - There is no third-highest salary as there are only two employees

### Solution

In [ ]:
SELECT
    dpt.name AS Department,
    Employee,
    Salary
FROM(
    SELECT 
        name AS Employee,
        salary AS Salary,
        departmentId,
        DENSE_RANK() OVER (PARTITION BY departmentId ORDER BY salary DESC) AS dt_rank
    FROM Employee) as ranked
LEFT JOIN Department dpt ON ranked.departmentId = dpt.id 
WHERE dt_rank <= 3

**Idea**: We use `DENSE_RANK()` instead of `RANK()` for tie without skip; then `PARTITION BY` to rank seperately between departments.

---

# SECTION 7: ADVANCED STRING FUNCTIONS/ REGEX/ CLAUSE

## Problem 44

*[(1667. Fix Names in a Table)](https://leetcode.com/problems/fix-names-in-a-table)*

### Problem statement

Table: `Users`

| Column Name | Type    |
|-------------|---------|
| user_id     | int     |
| name        | varchar |

`user_id` is the primary key (column with unique values) for this table.  
This table contains the ID and the name of the user. The name consists of only lowercase and uppercase characters.

Write a solution to **fix the names so that only the first character is uppercase and the rest are lowercase.**

Return the result table **ordered by** `user_id`.

The result format is in the following example.

Example 1:

**Input:**  
`Users` table:
| user_id | name  |
|---------|-------|
| 1       | aLice |
| 2       | bOB   |

**Output:**  
| user_id | name  |
|---------|-------|
| 1       | Alice |
| 2       | Bob   |

### Solution

In [ ]:
SELECT 
    user_id,
    CONCAT(UPPER(SUBSTR(name,1,1)), LOWER(SUBSTR(name, 2))) AS name
FROM 
    Users
ORDER BY 
    user_id

### Problem 45

*[(1667. Fix Names in a Table)](https://leetcode.com/problems/fix-names-in-a-table)*

### Problem statement

Table: `Patients`

| Column Name  | Type    |
|--------------|---------|
| patient_id   | int     |
| patient_name | varchar |
| conditions   | varchar |

`patient_id` is the primary key (column with unique values) for this table.  
`conditions` contains 0 or more codes separated by spaces.  
This table contains information of the patients in the hospital.

Write a solution to find the `patient_id`, `patient_name`, and `conditions` of the patients who **have Type I Diabetes**. Type I Diabetes always starts with `DIAB1` prefix.

Return the result table in **any order.**

The result format is in the following example.

**Example 1:**

**Input:**  
`Patients` table:
| patient_id | patient_name | conditions   |
|------------|--------------|--------------|
| 1          | Daniel       | YFEV COUGH   |
| 2          | Alice        |              |
| 3          | Bob          | DIAB100 MYOP |
| 4          | George       | ACNE DIAB100 |
| 5          | Alain        | DIAB201      |

**Output:**  
| patient_id | patient_name | conditions   |
|------------|--------------|--------------|
| 3          | Bob          | DIAB100 MYOP |
| 4          | George       | ACNE DIAB100 |

**Explanation:**  
Bob and George both have a condition that starts with `DIAB1`.

### Solution

In [ ]:
SELECT *
FROM Patients
WHERE conditions REGEXP '\\bDIAB1';

## Problem 46

*[(196. Delete Duplicate Emails)](https://leetcode.com/problems/delete-duplicate-emails)*

### Problem statement

Table: `Person`

| Column Name | Type    |
|-------------|---------|
| id          | int     |
| email       | varchar |

`id` is the primary key (column with unique values) for this table.  
Each row of this table contains an email. The emails will not contain uppercase letters.

Write a solution to **delete all duplicate emails**, keeping only one unique email with the smallest `id`.

For SQL users, please note that you are supposed to write a `DELETE` statement and not a `SELECT` one.

For Pandas users, please note that you are supposed to modify `Person` in place.

After running your script, the answer shown is the `Person` table. The driver will first compile and run your piece of code and then show the `Person` table. The final order of the `Person` table does not matter.

The result format is in the following example.

**Example 1:**

**Input:**  
`Person` table:
| id | email            |
|----|------------------|
| 1  | john@example.com |
| 2  | bob@example.com  |
| 3  | john@example.com |

**Output:**  
| id | email            |
|----|------------------|
| 1  | john@example.com |
| 2  | bob@example.com  |

**Explanation:**  
`john@example.com` is repeated two times. We keep the row with the smallest `id = 1`.

### Solution

In [ ]:
WITH list_unique AS
(
    SELECT (MIN(id)) AS id
    FROM Person
    GROUP BY email
)
DELETE FROM Person
WHERE id NOT IN (SELECT id FROM list_unique)

**Idea**: The CTE `list_unique` identifies the minimum `id` for each unique email in the "Person" table. 
- `MIN(id) AS id`: We select the minimum `id` value for each unique email in the "Person" table.
- `GROUP BY email`: This groups the rows by the email column, ensuring that only unique emails are considered.
  
Afterward, we `DELETE`all rows with id isn't in `list_unique`, those who are duplicates.

## Problem 47

*[(176. Second Highest Salary)](https://leetcode.com/problems/second-highest-salary)*

### Problem statement

Table: `Employee`

| Column Name | Type |
|-------------|------|
| id          | int  |
| salary      | int  |

`id` is the primary key (column with unique values) for this table.  
Each row of this table contains information about the salary of an employee.

Write a solution to find the second highest salary from the `Employee` table. If there is no second highest salary, return `null` (`None` in Pandas).

The result format is in the following example.

**Example 1:**

**Input:**  
`Employee` table:
| id | salary |
|----|--------|
| 1  | 100    |
| 2  | 200    |
| 3  | 300    |

**Output:**  
| SecondHighestSalary |
|---------------------|
| 200                 |

**Example 2:**

**Input:**  
`Employee` table:
| id | salary |
|----|--------|
| 1  | 100    |

**Output:**  
| SecondHighestSalary |
|---------------------|
| null                |

### Solution

In [ ]:
SELECT 
    (CASE WHEN SUM(rt)>1 THEN salary ELSE NULL END) AS SecondHighestSalary
FROM(
    SELECT
        DENSE_RANK() OVER (ORDER BY salary DESC) AS rt,
        salary
    FROM Employee) Employee_ranked
WHERE rt = 2

**Idea**: To obtain the second highest salary we use `DENSE_RANK()` then filter with `WHERE rt = 2`, and to make the cell become `NULL` when there is no second highest salary, we add a CASE WHEN after finding salary rank (`rt`)

### Problem 48

*[(1484. Group Sold Products By The Date)](https://leetcode.com/problems/group-sold-products-by-the-date)*

### Problem statement

Table: `Activities`

| Column Name | Type    |
|-------------|---------|
| sell_date   | date    |
| product     | varchar |

Each row of this table contains the product name and the date it was sold in a market.

Write a solution to **find for each date the number of different products sold and their names.**

The sold products names for each date should be sorted lexicographically.

Return the result table **ordered by** `sell_date`.

The result format is in the following example.

**Example 1:**

**Input:**  
`Activities` table:
| sell_date  | product    |
|------------|------------|
| 2020-05-30 | Headphone  |
| 2020-06-01 | Pencil     |
| 2020-06-02 | Mask       |
| 2020-05-30 | Basketball |
| 2020-06-01 | Bible      |
| 2020-06-02 | Mask       |
| 2020-05-30 | T-Shirt    |

**Output:**  
| sell_date  | num_sold | products                     |
|------------|----------|------------------------------|
| 2020-05-30 | 3        | Basketball,Headphone,T-shirt |
| 2020-06-01 | 2        | Bible,Pencil                 |
| 2020-06-02 | 1        | Mask                         |

**Explanation:**   
- For 2020-05-30, Sold items were (Headphone, Basketball, T-shirt), we sort them lexicographically and separate them by a comma.  
- For 2020-06-01, Sold items were (Pencil, Bible), we sort them lexicographically and separate them by a comma.  
- For 2020-06-02, the Sold item is (Mask), we just return it.

### Solution

In [ ]:
SELECT 
    sell_date,
    COUNT(DISTINCT product) AS num_sold,
    GROUP_CONCAT(DISTINCT product ORDER BY product) AS products
FROM Activities
GROUP BY sell_date

### Problem 49

*[(1327. List the Products Ordered in a Period)](https://leetcode.com/problems/list-the-products-ordered-in-a-period)*

### Problem statement

Table: `Products`

| Column Name      | Type    |
|------------------|---------|
| product_id       | int     |
| product_name     | varchar |
| product_category | varchar |

`product_id` is the primary key (column with unique values) for this table.
This table contains data about the company's products.

Table: `Orders`

| Column Name   | Type  |
|---------------|-------|
| product_id    | int   |
| order_date    | date  |
| unit          | int   |

This table may have duplicate rows.
`product_id` is a foreign key (reference column) to the `Products` table.
`unit` is the number of products ordered in `order_date`.

Write a solution to get the names of **products that have at least 100 units ordered in February 2020** and their amount.

Return the result table in **any order.**

The result format is in the following example.

**Example 1:**

**Input:**
`Products` table:
| product_id | product_name          | product_category |
|------------|-----------------------|------------------|
| 1          | Leetcode Solutions    | Book             |
| 2          | Jewels of Stringology | Book             |
| 3          | HP                    | Laptop           |
| 4          | Lenovo                | Laptop           |
| 5          | Leetcode Kit          | T-shirt          |

`Orders` table:
| product_id | order_date | unit |
|------------|------------|------|
| 1          | 2020-02-05 | 60   |
| 1          | 2020-02-10 | 70   |
| 2          | 2020-01-18 | 30   |
| 2          | 2020-02-11 | 80   |
| 3          | 2020-02-17 | 2    |
| 3          | 2020-02-24 | 3    |
| 4          | 2020-03-01 | 20   |
| 4          | 2020-03-04 | 30   |
| 4          | 2020-03-04 | 60   |
| 5          | 2020-02-25 | 50   |
| 5          | 2020-02-27 | 50   |
| 5          | 2020-03-01 | 50   |

**Output:**
| product_name       | unit  |
|--------------------|-------|
| Leetcode Solutions | 130   |
| Leetcode Kit       | 100   |

**Explanation:** 
- Products with `product_id = 1` were ordered in February for a total of (60 + 70) = 130 units.
- Products with `product_id = 2` were ordered in February for a total of 80 units.
- Products with `product_id = 3` were ordered in February for a total of (2 + 3) = 5 units.
- Products with `product_id = 4` were not ordered in February 2020.
- Products with `product_id = 5` were ordered in February for a total of (50 + 50) = 100 units.

### Solution

In [ ]:
SELECT 
    p.product_name, 
    su.unit
FROM
(
    SELECT 
        product_id,
        SUM(unit) as unit
    FROM 
        Orders
    WHERE MONTH(order_date) = 2 AND YEAR(order_date) = 2020
    GROUP BY product_id
) AS su
LEFT JOIN Products p ON su.product_id = p.product_id
WHERE unit >= 100

**Idea**: We use subquerry to calculate sum for each unit with respect to the time condition (February 2020), then use `LEFT JOIN` to return the name by id of a product

### Problem 50

*[(1517. Find Users With Valid E-Mails)](https://leetcode.com/problems/find-users-with-valid-e-mails)*

### Problem statement

Table: `Users`

| Column Name   | Type    |
|---------------|---------|
| user_id       | int     |
| name          | varchar |
| mail          | varchar |

`user_id` is the primary key (column with unique values) for this table.
This table contains information of the users signed up on a website. Some e-mails are invalid.

Write a solution to **find the users who have valid emails.**

A valid e-mail has a prefix name and a domain where:

- The prefix name is a string that may contain letters (upper or lower case), digits, underscore '_', period '.', and/or dash '-'. The prefix name must start with a letter.
- The domain is '@leetcode.com'.

Return the result table in **any order.**

The result format is in the following example.

**Example 1:**

**Input:** 
`Users` table:
| user_id | name      | mail                    |
|---------|-----------|-------------------------|
| 1       | Winston   | winston@leetcode.com    |
| 2       | Jonathan  | jonathanisgreat         |
| 3       | Annabelle | bella-@leetcode.com     |
| 4       | Sally     | sally.come@leetcode.com |
| 5       | Marwan    | quarz#2020@leetcode.com |
| 6       | David     | david69@gmail.com       |
| 7       | Shapiro   | .shapo@leetcode.com     |

Output: 
| user_id | name      | mail                    |
|---------|-----------|-------------------------|
| 1       | Winston   | winston@leetcode.com    |
| 3       | Annabelle | bella-@leetcode.com     |
| 4       | Sally     | sally.come@leetcode.com |

**Explanation:** 
- The mail of user 2 does not have a domain.
- The mail of user 5 has the '#' sign which is not allowed.
- The mail of user 6 does not have the leetcode domain.
- The mail of user 7 starts with a period.

### Solution

In [ ]:
SELECT *
FROM Users
WHERE mail REGEXP '^[a-zA-Z][a-zA-Z0-9._-]*@leetcode\\.com$'
# First char as character, 2nd part contains character, digits, ., _, and hyphen -(here need to put at the end, or at the beginning)
# the * indicate the part [a-zA-Z0-9._-] is optional, an email might be created with only first char, exp: a@leetcode.com

---